{
  "books": [
    {
      "gradeId": "Lớp 6",
      "subjectId": "Tiếng Anh",
      "id": "0fc790c2-a77d-4a5d-b4b1-98bed2c4c97c",
      "name": "Tiếng Anh 6 - tập 2",
      "publisher": "SGV",
      "year": null,
      "bookDataToGenerateQuestionUrl": null,
      "chapters": [
        {
          "id": "24cce543-ee1d-4b1d-bb16-67305202547c",
          "name": "Unit 7 TELEVISION",
          "lessons": [
            {
              "id": "3c092c05-888a-44f2-85ab-0764f8fdda3c",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n- use the words related to TV programmes and people;\n- pronounce the sounds /@/ and /@/ correctly;\n- use wh-question words to make questions;\n- use conjunctions to connect clauses in compound sentences;\n- ask for and give information about TV programmes;\n- read for general and specific information about a TV guide;\n- talk about a favourite TV programme;\n- listen for specific information about different TV programmes;\n- write a paragraph about TV-viewing habits.\nWARM-UP & INTRODUCTION\nAims:\n- To create a friendly and active atmosphere in the class before the lesson;\n- To give the teacher and Ss a chance to introduce themselves;\n- To lead into the new unit.\nReview the previous unit before Ss open their books. Organise a short if you remember  game to revise how other countries celebrate their New Years. For example, T can say  Throwing water on other people and Ss respond Thailand. Continue with about 4 - 5  countries Ss have learnt from Unit 6.\nCreate a spider web. To start the lesson, write the word TELEVISION in the centre of  the web and ask Ss to call out words related to the topic. T may allow them to give  Vietnamese words and ask other Ss in the class for the English equivalent. Then write  in the corner of the board a list of the words Ss don’t know and ask them to keep a  record for later reference when the unit finishes.\nWHAT’S ON TODAY?\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n- To introduce the topic of the unit.\n- Set the context for the introductory text: Ask Ss to look at the title of the conversation and the picture.  Ask them some questions like:\n● What do you think they are talking about? \t\t● What channel/ programme do you like best?\n● Do you like watching TV? Why / Why not? \t\t● …\n● How many hours a day do you watch TV?\n- Encourage Ss to give their answers, but do not confirm whether their answers are right or wrong.\n- Play the recording twice for Ss to listen and read along. Have Ss underline the words that are related to  the unit's topic while they are listening and reading.\n- Invite some pairs of Ss to read the dialogue aloud.\n- Ask Ss what exactly Phong and Hung are talking about. Now confirm the correct answer. (They are  talking about their favourite TV programmes.)\n- Have Ss say the words in the text that they think are related to the topic Television. Quickly write the  words on one part of the board.\nACTIVITY 2\nAim: To help Ss focus on the topic of the lesson.\n- Ask Ss to read the questions carefully and choose the correct answers. Encourage them not to look  back at the conversation.\n- Allow Ss to work in pairs if they would like to.\n- Check their answers as a class. Show them where in the conversation to find the answers.\nKey:1.C \t2.A \t3.A \t4.A\nACTIVITY 3\nAim: To help Ss learn the names of some TV programmes.\n- Encourage Ss to do this activity without looking back at the conversation. If they cannot, let them read  the conversation again to find the answers.\n- Allow Ss to work in pairs if they would like to.\n- Check their answers as a class.\nKey:1.c \t2.a \t3.e \t4.b \t5.d\nACTIVITY 4\nAim: To help Ss focus on the use of adjectives to describe TV programmes and characters.\n- Ask Ss to work independently. Guide them to look back at the conversation and find where the names  of the programmes / character appear.\n- Allow Ss to share their answers and discuss.\n- Check their answers as a class.\nKey: 1. interesting 2. wonderful 3. clever 4. educational\nACTIVITY 5\nAim: To help Ss talk about what TV programme(s) they like.\n- T can demonstrate by talking about his / her favourite programme(s) first. For example: I like films  about animals in faraway countries like Kenya or India. They are on the Animal Planet.\n- Then allow Ss some time to discuss in groups before they decide on the programmes they like.\n- Each group then shares their answers by reading them aloud to the class. The class votes for the group  with the most interesting answers.\nWRAP-UP\n- Ask one or two Ss to tell the class what they have learnt.\n- Ask Ss to say aloud some words they remember from the lesson.\n- If there is a visualiser in the classroom, show the dialogue, highlight the key words related to the topic.  It would be helpful if T also highlights in the dialogue the wh-question words and conjunctions, and  tells Ss that they will learn these language points in the following lessons."
            },
            {
              "id": "ae49b6e1-4f74-467c-a74c-ff9b480b2ee0",
              "name": "A CLOSER LOOK  1",
              "content": "Vocabulary\nACTIVITY 1\nAim: To teach Ss some words / phrases related to television.\n- Ask Ss to read the words / phrases in the box first and see if they can remember some of them from  the previous lesson.\n- Allow Ss to refer to Listen and read if needed to remind them of the context where these words  appear (except the words comedy and viewer).\n- Have Ss read the definitions and do the task. Allow them to work independently or in pairs.\n- Check their answers as a class.\nKey:\n1. character \t2. educational programme \t3. comedy\n4. talent show \t5. viewer\nACTIVITY 2\nAim: To give Ss further practice in using TV show-related words / phrases in context.\n- Ask Ss to read the sentences carefully and choose the correct words / phrases to complete them. (One  more new word: game show.)\n- Check their answers as a class.\nKey:\n1. channel \t2. character \t3. animated films\n4.game show\t 5. comedies \t6. viewers\nACTIVITY 3\nAim: To teach Ss more adjectives to describe television programmes and characters.\n- Teach the new words (live with a different meaning from the one they already know, and popular).\nSuggestion:\n● popular: You play football, | play football, Nam plays football ... -> Football is popular.\n● live: The contest is NOW at the City Hall. We are at home but we can watch what is happening there like  the audience at the Hall. -> We are watching the competition live.\n- Tmay ask Ss to give the Vietnamese equivalent of these words.\n- Ask Ss to work independently or in pairs. Encourage them to read the sentences carefully and look for  clues so that they can choose the right word to complete each sentence.\n- Check their answers as a class.\nKey:\n1. popular \t2. boring \t3. cute\n4. live \t\t5. funny \t6. educational\nPronunciation\n/8/ and /8/\nACTIVITY 4\nAim: To help Ss identify how to pronounce the sounds /6/ and /8/, and practise pronouncing these  sounds.\nThe /8/ and /6/ sounds are among the most difficult English sounds for Vietnamese Ss as we do not have  them in our language.\n- Ask Ss to read the words first as they are all familiar with Ss.\n- Play the recording and ask Ss to listen carefully and check if they have pronounced them correctly.\n- Play the recording again. Ss listen and repeat. Check their pronunciation by calling some Ss to read the  words individually.\nAudio script:\n/@/: theatre, earth, anything, both, through\n/6/: there, them, neither, weather, than\nACTIVITY 5\nAim: To help Ss pronounce the sounds /@/ and /8/ correctly in context.\n- Don't take this task too seriously. It's a way to make learning pronunciation fun.\n- Have Ss practise reading the tongue twisters among themselves: slowly at first, then faster and faster.  Tell them to pay attention to the key words with the /@/ and /8/ sounds. T may also turn it into a  competition to see who / which group can read the twisters fast and correctly.\nAsk Ss to summarise what they have learnt in the lesson."
            },
            {
              "id": "f395e072-5d7f-4c5c-96bf-ba52df0dc5de",
              "name": "A CLOSER LOOK 2",
              "content": "Grammar\nWh-questions\nSs can easily recognise these question words as they have been dealing with them in the previous lessons.  SoT can go straight into the teaching of this grammar point.\nACTIVITY 1\nAim: To remind Ss of the questions they are familiar with.\n- Ask Ss to read the conversation and underline the question words.\n- Check their answers as a class.\n- Demonstrate some more wh-questions with other wh-words. Ask Ss to answer to make sure that they  know what information the question is requiring. For example: Who is standing in this class? How many  pictures are there on the wall? etc.\nKey: What are you doing tomorrow?\nWhere is it?\nHow long is it on?\nACTIVITY 2\nAim: To help Ss identify the functions of different question words.\n– Allow Ss to read and do the matching individually or in pairs.\n- Check their answers as a class.\n- Explain if Ss have any difficulty understanding how to use the question words.\nKey:\nWhen - time \t\tHow many - number\nHow often - repetition \tWhat - thing\nWhere - place\t\t Who - people \t\t\tWhy - reason\nRemember!\n- Remind Ss that each question word asks for a different piece of information.\n- Check if Ss fully understand this by asking wh-questions and requiring Ss to answer in short.\nACTIVITY 3\nAim: To give Ss more practice with question words.\n- Allow Ss some time to complete the conversations. Suggest they should look at the answer in order to  choose the correct question word from the box.\n- Play the recording. Ask Ss to listen and check their answers. Also remind them to pay attention to the  tune of the wh-questions (falling at the end).\n- Check their answers as a class.\nKey:\n1. How often, What\n2.Who\n3. When, Where\nAudio script:\nConversation 1\nA: How often do you watch TV?\nB: Not very often. Two or three times a week.\nA: What do you watch?\nB: lt depends. But | like talent shows the most.\nConversation 2\nA:Who do you like the most in Doraemon?\nB: Nobita. He's so funny.\nConversation 3\nA:When do you play football?\nB: Usually on Saturday or Sunday.\nA: Where do you play?\nB: In the yard.\nConjunctions in compound sentences\n- Ss are expected to know the meanings as well as the use of the three conjunctions: and, but, so.\n- Write the examples in the Remember! box on the board and underline the conjunctions in the sentences.\n- Circle the clauses before and after the conjunction.\n- Draw Ss’ attention that conjunctions are used to connect two clauses into a compound sentence.  (e.g. enjoy sports, so | spend a lot of time outdoors.)\nACTIVITY 4\nAim: To help Ss identify the meaning and the position of a conjunction.\n- Have Ss work individually or in pairs.\n- Ask them to read the clauses in the Beginnings column carefully and find clues in the Endings column  for matching.\n- Check Ss’ answers as a class.\n- Call on some Ss to read the complete sentences out loud.\nKey: 1.c\t2.a\t3.e\t4.b\t 5.d\nACTIVITY 5\nAim: To give Ss some practice in using conjunctions.\n- This is a more difficult task as Ss have to decide what conjunction to use for each sentence.\n-  Remind Ss to read each sentence and decide what the relationship of the two clauses is before they  choose the correct answer.\n-  Ss work individually or in pairs. They can later exchange and check their answers.\n-  Check their answers as a class.\nKey: 1.so \t2. but \t3.so \t4. but \t5.and\nWRAP-UP\n-  Summarise the main grammar points of the lesson.\n-  Say a question word and ask Ss to respond by making a question with it.\nEg.\nT: How many\nSs: How many students are there in our class? / How many coloured pencils do you have?\n-  Write quickly on the board some sentences with blanks for Ss to fill using conjunctions.\nEg.\nI'm not big, I'm strong.\nShe reads a lot, she won the game show."
            },
            {
              "id": "b22b1b62-69bd-4305-8085-cab6b24dedb9",
              "name": "COMMUNICATION",
              "content": "0Everyday English\nAsking for and giving information about TV programmes\n- Tell Ss that they are going to learn how to ask for and give information about TV programmes.\n-  Ask Ss to make questions about the different kinds of TV programmes. Write them on the board.\nACTIVITIES 1 + 2\nAims:\n- To introduce a sample conversation about aTV programme;\n- Tohelp Ss practise asking for and giving information about TV programmes.\n1. Ask Ss to read the conversation as an example. Tell Ss that they can use what, what time, why, etc.  to ask about TV programmes.\nAudio script:\nA: What's your favourite TV programme?\nB: The animal programme.\nA: Why do you like it?\nB: Because | can see the animals in their real life.\n2 Allow Ss to work in pairs and make a similar conversation about their favourite TV programme.  Encourage them to include as many questions as possible in their conversations. Call on some pairs to  act out their conversations in front of the class. Check and correct if needed.\nTV programmes\nACTIVITY 3\nAim: To allow Ss to explore some interesting facts about TV in other countries.\nDon't turn this task into a serious test of information.\n-  Ss work in groups and help one another to find the answers / make guesses.\n- Call on some Ss for the answers. Remind them of the correct way to give their answers.\nE.g. Pokemon cartoons are from Japan. (They know the answer.)\nWe think Pokemon cartoons are from Japan. (They make a guess.)\n-  Confirm the answers with the whole class.\nNotes:\n-  Pokemon cartoons: Japanese television animation series, typically aimed at adults as well as children.  - Iceland /‘atsland/: Before 1981, there was no TV in July; before 1986, there was no TV on Thursday.  It is because people felt they could do without TV once a week! They wanted everyone to spend this  time outdoors or with their families.\n- Discovery Channel: an American pay television network. It creates the high quality content.\nKey: 1. Japan \t2. Viet Nam \t3. Iceland \t4.the USA\nACTIVITY 4\nAim: To introduce to Ss some TV programmes for children.\n- AskSstoreadthe passages and do the task. Remind them that some facts may refer to both programmes.\n-  Have Ss work individually or in pairs.\n-  Check their answers as a class. Ask them where in the text they found the answers.\nKey:\n1. Both programmes\t\t 2. Let's Learn\n3. Hello Fatty \t\t\t4. Let's Learn \t\t5. Hello Fatty\nACTIVITY 5\nAim: To allow Ss an opportunity to practise with the information from the TV programmes in 4.\n-  Allow Ss about three minutes to refer to 4 and choose the programme they prefer. Encourage them  to focus on the reasons why they like it.\n-  Ask Ss to work in groups and share their ideas. Each group then shares their answers with the class.\nWRAP-UP\nHave Ss say what they have learnt in the lesson."
            },
            {
              "id": "454ebf23-0a16-413a-9ecb-e637f96080d5",
              "name": "SKILLS 1",
              "content": "Reading\nACTIVITY 1\nAim: To teach Ss how to read a TV guide.\n- Ask Ss to have a quick look at the TV guide and answer questions like What information do you see? (the  time, the name of the programme and its content), What information comes first? What comes next? and  What do you look at when you are choosing a programme to watch? This task should be done carefully  as it helps do task 2.\nNote: Explain to Ss so that they can distinguish the name of the programme (e.g. Sports) and the name  of the specific event / show / film, etc. on that programme (e.g. The Pig Race).\n-  Allow Ss some time to read the TV guide and answer the questions.\n-  Check their answers as a class.\nKey:\n1. (It’s) Cuc Phuong Forest.\t\t\t2. Yes, it is.\n3. It's on at 10.30. \t\t\t\t4. No, we can't. \t\t\t\t5. (It's about) dolphins.\nACTIVITY 2\nAim: To show Ss how to find a suitable TV programme for a person.\n- Ask Ss to read the information about each person carefully, underline the key word(s) showing what  each person likes in order to help them find the answer.\n-  Allow Ss sometime to do the task individually. Ask some Ss to share their answers before checking as a class.\nKey:\n1. Phong: Children are Always Right\t\t 2. Bob: The Fox Teacher\n3. Nga: Cuc Phuong Forest \t\t\t4. Minh: The Pig Race\n5. Linh: The Dolphins\nSpeaking\nACTIVITY 3\nAim: To allow Ss to talk about what they have done in Reading 2.\n-  Have Ss work in groups and share their answers in 2 with the groups. Encourage other Ss to say if they  agree or disagree with the answers and explain their partners’ choice.\n-  Call on some Ss to demonstrate it in front of the class.\nACTIVITY 4\nAim: To teach Ss how to talk about their favourite TV programmes.\n- Ask Ss to read the instructions carefully and allow them some time to prepare their answers.  - Tell Ss that the suggested structure can help them organise their ideas.\n- Have Ss share their answers in groups before calling some of them to present their answers to the class.  Correct any mistakes later.\nWRAP-UP\nHave Ss summarise:\n-  what they have learnt in the lesson with the two skills;\n- what words / phrases / sentences for describing television they can remember;\n- how to talk about a TV programme they like."
            },
            {
              "id": "e900861a-3f0d-4378-a190-99b12f5db562",
              "name": "SKILLS 2",
              "content": "Listening\nACTIVITY 1\nAim: To help Ss develop their listening skill for specific information.\n-  Allow Ss some time to read the programmes in the table.\n- Ask them to focus only on the information they need: the channel.\n-  Play the recording. Ss listen and tick.\n-  Check their answers as a class.\nKey:\nACTIVITY 2\nAim: To help Ss develop their listening skill for specific information.\n- This activity requires Ss to listen more carefully for details.\n- Allow Ss some time to read the statements first and see if they can answer any of them based on the  previous listening.\n-  Draw Ss’ attention to the fact that almost all the questions start with the names of the programmes.  They are signals that the answers are coming.\n-  Play the recording. Ss listen and tick.\n- Check their answers as a class. If Ss have difficulty catching the information, determining their answers, pause the recording after each sentence where the information appears.\nKey:1.T \t2.F \t3.T \t4.F\nAudio script:\nHere are some interesting TV programmes for you. Green Summer, a music programme, is on channel 1.  It starts at eight o'clock. My Childhood is on channel 2. It’s the story of a country boy and his dog Billy.  On channel 3, you will watch Harry Potter at 8.30. Children all over the world love this film. If you like  to learn English, you can go to English and Fun on channel 1. It’s at nine o'clock. We hope you can  choose a programme for yourself. Enjoy and have a great time.\nWriting\nACTIVITY 3\nAim: To guide and prepare Ss with information for their writing in 4.\n- Ss have to answer a questionnaire about TV-viewing habits.\n- Have Ss read the questions and choose the most appropriate answers for themselves.\nACTIVITY 4\nAim: To guide Ss how to write a paragraph about TV-viewing habits.\n-  Have Ss work individually. Ask them to refer to the questions and their answers in 3 while they are  writing. These questions are a very good guide of how to form a sentence and what information they  need to complete the sentence.\n-  Go round and offer help if needed.\n- If time allows, ask some Ss to share their writing with the class. If not, collect some Ss’ writings to  correct at home.\nNote: Tell Ss that the information in the questions in 3 has been arranged ina logical order and they can  organise their writing by referring to their answers one after another.\nSample answer:\n| like watching TV, about one hour a day. | only watch TV in the evening. During the day, | go to school.  On Saturday and Sunday, | watch more. Sometimes | watch TV when I'm eating, but | never watch TV  when I’m studying. | watch Science programme the most. It has interesting educational programmes for children."
            },
            {
              "id": "b95614ef-1d9b-4a84-837d-a82e09b8d02f",
              "name": "LOOKING BACK",
              "content": "- Encourage Ss to complete Looking Back without referring to the previous sections in the unit.\n-  Ask Ss to record their results for each exercise in order to identify the areas they need further review.\nVocabulary\nACTIVITY 1\nAim: To help Ss revise the vocabulary about television.\n-  Ask Ss to do the task individually.\n-  Allow Ss some time to read the list of the words and write them in the correct place in the table.\n-  Have Ss swap their answers to double check.\n- Call on some Ss to read aloud their answers before checking them as a class.\nKey:\nACTIVITY 2\nAim: To help Ss revise the vocabulary about television in context.\nThis activity is for the revision of the vocabulary in a contextualised situation. Ss have to be able to  recognise the relationship of the target words and their neighbours, the context in which they appear.\n- Ask Ss to do the task individually.\n-  Have Ss swap their answers to double check.\n- Call on some $s to read aloud their answers before checking them as a class.\nKey: 1. viewers\t\t 2. animal \t\t3. sports \t\t4. funny \t\t5. educational\nGrammar\nACTIVITY 3\nAim: To help Ss revise the use of question words.\n-  Ask Ss to look at the answers and underline the missing information from the questions so that they  can decide which question words to use.\n-  Go round and offer help if needed.\n-  Check their answers as a class.\nKey:1. How many \t 2. What \t3.Why \t\t4. Who \t\t5. How many\nACTIVITY 4\nAim: To help Ss revise the use of conjunctions.\n- Ask Ss to read the two sentences in each question and use the conjunctions provided to connect them.\n-  Check their answers as a class.\nNote: Note that in most sentences, the conjunctions are used to replace the full stop and connect the  two sentences.\nKey:\n1. Ocean Life is on at 7.30, and Laughing out Loud comes next at 8.00.\n2.1 like The Seven Kitties very much, so | watch it every day.\n3. BBC One is a British channel, but VTV6 is a Vietnamese channel.\n4. Along the Coast is a famous TV series, but | don't like it.\n5.1 have a lot of homework tonight, so | can’t watch Eight Feet Below.\nWRAP-UP\nHave Ss look at the Now I can... table."
            },
            {
              "id": "4b4b1b63-e4b0-4c87-994f-24e20263d633",
              "name": "PROJECT",
              "content": "This project introduces to Ss a new way of learning and practising their learnt language outside the class.  Organise the activity in a way that Ss will be able to go out and ask questions to find out how important TV  is to their friends, to take notes of the answers, and to report the results to other people (their classmates).\n-  Divide Ss into groups of four or five and instruct them on what they have to do. Encourage them to  reach out of the classroom (interviewing their parents, siblings, neighbours, etc.).\n-  Ask Ss to share their findings with the class. If time allows, T can use the results of the project for the  class discussion to see how much TV watching is enough / good / bad and the role of TV for children.\nNOW I CAN...\nAsk Ss to complete the self-assessment table. Discuss as a class what difficulties remain and what areas  Ss have mastered."
            }
          ]
        },
        {
          "id": "bcbdfe8f-1f91-4750-9d75-fc22dc36b773",
          "name": "Unit 8 SPORTS AND GAMES",
          "lessons": [
            {
              "id": "28f1c685-6610-41c7-af7c-0982235b8fcc",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n-  use the words related to the topic Sports and Games;\n- pronounce the sounds /e/ and /z/ correctly;\n- use the past simple;\n-  use imperatives to tell someone to do something;\n-  express and respond to congratulations;\n-  read for general and specific information about favourite sports stars;\n- talk about famous sportspeople;\n- listen for general and specific information about sport(s) / game(s);\n-  write a paragraph about a sport / game.\nWARM-UP & INTRODUCTION\nAims:\n- To create an active atmosphere in the class before the lesson;\n- Tolead into the new unit.\nBegin the lesson by reviewing the previous unit before Ss open their books. T may  have Ss revise the words learnt in Unit 7, or ask them what TV programmes they like to watch, or whether they like to watch sports programmes onTV.\nThen lead Ss to the new unit. Write the unit title Sports and Games on the board.  Ask Ss to guess what they are going to learn about in this unit. After Ss give the  answers, ask them to open their books to page 16. Draw their attention to the box  and introduce what they are going to learn in this unit.\nAT THE GYM\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n- To introduce the topic of the unit.\n-  Ask Ss to look at the picture and guess what it shows or what the conversation between Duong and  Mai might be about.\n-  Ask Ss questions about the picture. E.g. Who do you see in the picture? Where are they? What do you think  they're talking about?\n-  Tell Ss that Duong and Mai are at the gym, talking about the sports / games they play.\n-  Tell Ss to listen to their conversation.\n- Play the recording two or three times, or more if necessary. Ask Ss to listen and read along. Have Ss  underline the words related to the unit's topic while they are listening and reading.\n- Callonsome pairs of Ss to read the dialogue aloud. Have the whole class read the new words in chorus.  Tell them to pay attention to the words having the sounds /e/ and /z/.\nACTIVITY 2\nAims:\n- Tohelp Ss practise using words related to the topic Sports and Games;\n- To help Ss understand the conversation better.\n- Ask Ss to do this activity independently. Remind them of the ways to do the activity if needed. Ss may  refer back to the conversation for the context of the words they need to fill the gaps. Allow them to  share their answers before they discuss them in pairs or as a class.\n-  Write the correct answers on the board.\n- Texplains the meanings of some words if necessary. Ss practise saying the sentences together.\nKey: 1. fit \t2.gym \t\t3. table tennis \t\t4. Club \t5. cycle\nACTIVITY 3\nAim: To help Ss revise / learn names of some sports and games through pictures.\n-  Ask Ss to label the pictures with the correct words given. Ss can work in pairs. Elicit Ss’ answers. Then  provide the correct words.\n- Ask them for the meanings of the words. Provide them with the meanings of the words they don’t  know. T may also ask them if they play these sports and games or if people in Viet Nam play them.\nKey:\n1. cycling \t2. aerobics \t\t3. table tennis\n4.swimming \t5. chess \t\t6. volleyball\n-  Help Ss differentiate between a sport and a game:\nAsport: an activity that you do for pleasure and that needs physical exercise.\nAgame:an activity or a sport with rules in which people or teams compete against each other.\n- T may ask Ss to give the names of some sports and some games they know. For example:\nSports: running, cycling, mountain climbing, ...\nGames: chess, football, card games, computer games, ...\nACTIVITY 4\nAim: To help Ss practise speaking and learn about how sporty they are.\n-  Have Ss work in pairs (or in groups) to ask and answer the questions. Some pairs (or groups) may report  their results to the class. (In their groups, how many Ss with answers “A’, how many with answers “B”  and who is the sportiest in their groups.)\n-  T may want to find out how sporty the class is by writing the results on the board.\nWRAP-UP\n- Ask one or two Ss to tell the class what they have learnt.\n- Ask Ss to say some words they remember from the lesson.\n-  If there is a visualiser in the classroom, show the dialogue, highlight the key words related to the topic."
            },
            {
              "id": "333a0a50-d48a-4434-90f0-359bcfb384a9",
              "name": "A CLOSER LOOK  1",
              "content": "Vocabulary\nACTIVITY 1\nAim: To revise / teach the names of some equipment to be used in some sports / games.\n- Ask Ss to look at the pictures and see if they can write the words under the pictures.\n-  Have Ss work individually. Tell them to put the words and phrases given under the right pictures.\n- Check their answers as a class. Explain the meanings to them if necessary. If there is enough time, have  Ss give examples.\nKey: 1. ball \t2. sports shoes \t\t3. boat \t\t4.racket \t5.goggles\nACTIVITY 2\nAim: To revise / teach the names of some sports / games and the equipment to be used in the  sports/ games.\n- Tell Ss to do the task independently first.\n- Callon some Ss to write their answers on the board, then check their answers as a class.\nKey.1.c \t2.d \t3.a \t4.b \t5.e\nExtension: Ask stronger Ss to name more sports and games and the equipment used in these sports / games.\nEg.\n-  table tennis - bats\n-  running - sports shoes\n-  chess - chessboard + chessmen / chess pieces\n…\nACTIVITY 3\nAim: To give Ss practice in using words related to sports / games in context.\n-  Have Ss read the sentences and fill the blanks with the words given.\n-  Have them read the sentences carefully and look for clues so that they can choose the correct words  to complete the sentences.\n-  Have one student write the words on the board. T gives correction.\nFor stronger Ss, ask them to make sentences with the words. Other Ss and T give comments.\nKey:\n1. competition \t\t2. champion \t\t3. congratulations\n4. sporty \t\t5. marathon\nPronunciation\n/e/ and /z/\nACTIVITY 4\nAims:\n- To help Ss identify how to pronounce the sounds /e/ and /z/;\n- Tohelp Ss practise pronouncing the two sounds in words.\n-  Have Ss practise the sounds /e/ and /e/ in isolation first.\n-  Have them observe T's mouth for the correct pronunciation of these two sounds.  -  Play the recording and ask Ss to listen and repeat the words. Play the recording as many times as  necessary.\nAudio script:\n/e/: chess \ttennis \t\texercise \tcontest\nJee/: racket \tmatch\t\t marathon \tactive\nACTIVITY 5\nAim: To help Ss pronounce the sounds /e/ and /z/ in words and in sentences.\n-  Play the recording. Have Ss listen and repeat sentence by sentence.\n-  Help them recognise the two sounds, then underline the correct words in the sentences.\n-  Correct their pronunciation and intonation. Play the recording again for them to practise if necessary.\nKey + Audio script:\n1. They cannot take part in this contest.\n2. They began the match very late.\n3. Please get the racket for me.\n4. We play chess every Saturday.\n5. My grandpa is old, but he's active.\nWRAP-UP\nAsk Ss to summarise what they have learnt in the lesson."
            },
            {
              "id": "14c4baba-0662-4db6-8801-85ec47c921af",
              "name": "A CLOSER LOOK 2",
              "content": "Grammar\nThe past simple\nIntroduction\n-  The past simple was already introduced in Tieng Anh 5, so T asks Ss to recall it and give examples.\n-  T may ask them some questions. E.g. What did you do last Sunday? etc.\n-  Then encourage Ss to talk about past actions.\n-  Tasks Ss to give the rule and use of the past simple themselves. Then T explains to them if necessary  (use the Grammar box). T can give more examples if necessary. Remind them of using the past simple  when something happened (e.g. yesterday, last Sunday, last month, etc.).\nPositive:\n1/You / We /They / He / She / It + V-ed (played)\nNegative:\n1/You/We/They / He/She /It + did not / didn’t V(did not / didn’t play)\nQuestions and short answers:\nDid /you/ we /they / he / she / it + V (play)?\nYes, |/ you / we / they / he / she / it did.\nNo, |/ you / we/ they/he/ she / it didn't.\nACTIVITY 1\nAim: To help Ss practise with the correct form of the past simple.\n-  Have Ss do the task individually and then compare their answers in pairs.\n-  Tell Ss that when they do the multiple choice questions, they should first read the sentences (stems) and  the options carefully. Then they should choose the answer that they think is correct by eliminating the  wrong answers. Then they get the most likely correct answer.\n-  Check and confirm Ss’ answers.\nKey: 1.C \t2.B \t3.C \t4.A\t 5.B\nACTIVITY 2\nAim: To help Ss practise using the past simple in context.\n-  Have Ss do the task individually. Ask them to read the conversation first, so that they understand the  context to use the verbs given in the correct form.\n-  T may call on some Ss separately to read out their answers and correct their answers if they're wrong.  T gives explanation if necessary.\n-  Then callonsome pairs to read the conversation with the correct verb forms. Correct their pronunciation  and intonation if necessary.\nKey:\n1. went\t\t 2. had \t\t3. did you do\n4.visited\t 5.ate \t\t6. scored\nACTIVITY 3\nAim: To help Ss practise using the past simple in real situation.\n-  Divide the class into groups of 4 or 5.\n-  Ss take turns to ask and answer questions about their last weekend.\nEncourage them to give as many sentences as possible. Tell them to use all three forms (affirmative,  negative, and questions).\n-  Some stronger Ss can report to the class about one of their friends’ last weekend.\nImperatives\n- T may begin by saying some sentences of imperatives (positive and negative).\n-  Then ask Ss to give the forms and uses of imperatives.\n-  Explain to Ss and ask them to give more examples.\nACTIVITY 4\nAim: To help Ss use the correct form of imperatives in different situations.\n-  Tell Ss to work in pairs. Give them about 2 - 3 minutes to do the task.\n- Go round, observe the class and give help if necessary.\n-  Callon some Ss to read their answers.\n-  Check their answers as a class.\nKey:\n1. Don't park \t\t2. Close \t\t3. Tidy up\n4. Don’t use \t\t5.Try\nACTIVITY 5\nAim: To help Ss practise using imperatives to tell someone to do something in a real context.\n-  Have Ss work in pairs or in groups.\n-  Ask them to take turns to tell their friends what to do and not to do at the gym.\n-  T gives help and lets them give as many sentences as possible.\nSome possible sentences:\n● Pay your fee first. \t\t\t\t● Don'tlitter.\n● Puton your trainers / sports shoes. \t\t● Don’teat or drink at the gym.\n● Listen to the instructor carefully.\t\t● x\nIf time allows, T may ask Ss to draw a picture illustrating one of the gym rules in the blank space at the  bottom of the page in their notebooks. Make sure that Ss write the rules somewhere in the picture. (This  may be done as homework.)\nWRAP-UP\n-  Summarise the main grammar points of the lesson.\n-  Ask Ss to make sentences about themselves, using the past simple.\n- Ask Ss to take turns to give an order or tell their friends to do an activity / follow everyday routine  (positive or negative). E.g. Get up early every day; Go to school on time; etc."
            },
            {
              "id": "a01cba5a-7dab-4396-8ed3-764f3f226844",
              "name": "COMMUNICATION",
              "content": "Everyday English\nExpressing and responding to congratulations\nThis section provides Ss with the way of expressing and responding to congratulations.  120 Unit 8/ Sports and Games\nACTIVITIES 1 + 2\nAims:\n-  To Introduce the way of expressing and responding to congratulations;\n-  Tohelp Ss practise expressing and responding to congratulations.\n1 Have Ss listen and read the short conversation. Tell them to pay attention to the highlighted parts.\nT may ask Ss to repeat these parts several times.\nAudio script:\nDuong: Last week | played table tennis with Duy, and | won for the first time.\nMai: -  Congratulations!\nDuong: Thank you, Mai.\nMai: -  Soyou're our class champion now.\n2 Allow Ss to work in pairs and make a similar conversation. Remind them to use the highlighted sentences  in 1. Then encourage them to devise different contexts to use the language.\nThe sport / game you like\nACTIVITY 3\nAims:\n- Tohave Ss revise / learn some knowledge of sports / games;\n- Tohelp Ss communicate through a quiz about sports / games.\nAsk Ss to work in pairs and find the answers to the quizzes. Check and give the correct answers.\nKey:\n1. There are usually 22 players (11 on each side).\n2. It normally lasts 90 minutes (divided into two halves).\n3. They take place every four years.\n4. A marathon is 42.195 kilometres long (26 miles and 385 yards).\n5. They took place in Olympia (in Ancient Greece) (in 776 BC).\nACTIVITY 4\nAim: To help Ss ask and answer questions about themselves concerning the field of sports / games.\n-  Divide the class into groups of 5 or 6.\n-  Appoint one student to be the interviewer and the others the interviewees.\n-  Give Ss plenty of time to ask and answer questions. Encourage them to talk and raise as many questions  as possible.\n-  Go round the class and give support if necessary.\n- After a fixed amount of time, choose the interviewer of some groups to present to the class. T and other Ss listen and make comments.\nWRAP-UP\nHave Ss say what they have learnt in the lesson."
            },
            {
              "id": "d9429619-b8af-4335-b5a2-61ff773c9f6c",
              "name": "SKILLS 1",
              "content": "Reading\nACTIVITY 1\nAim: To activate Ss’ knowledge of the topic of the reading text.\n- T may begin by asking Ss to name some famous football players in Viet Nam.\n-  Tell them to work in pairs to discuss the questions in this activity. Encourage them to give their ideas  (as many ideas as possible) in front of the class.\n-  Have Ss work in pairs and discuss the questions about Pelé. It is not important whether they know  much or little information about Pelé as long as they talk with each other.\nACTIVITY 2\nAim: To help Ss develop their reading skill for general information (skimming).\n-  Tell Ss to read the text quickly and check their ideas in 1.\n-  Seta strict time limit to ensure that Ss read quickly for information. Encourage Ss to give any piece of  information they can remember (and it is not so important what they say as long as they speak English).\nExample:\n● ... best footballer\n● ... from Brazil\n● ... won the World Cup\n● ... the King of Football\nACTIVITY 3\nAims:\n- Tohelp Ss develop their reading skill for specific information (scanning);\n- Tohelp Ss broaden and deepen their knowledge of Pelé.\n-  Give Ss some time to practise reading the dialogue. Ss listen to T (or other Ss) read aloud while tracking  the dialogue with their fingers.\n-  AskSs to read in chorus the new and difficult words / phrases in the dialogue.\n- Check with Ss the meanings of the new words. Explain to them if necessary.\n- Ask Ss to find the key words in each question. Then find the information in the dialogue to answer  the questions.\n-  Confirm the correct answers to the class.\nKey:\n1. Pelé was born in 1940.\n2. His father did. / His father taught him.\n3.He scored 1,281 goals in total.\n4. (He became Football Player of the Century) in 1999.\n5. They call him “The King of Football”.\nFurther practice:\n- If time allows, have Ss talk about Pelé (what other information they know about him, whether they like  him or not, and why, etc.).\n-  Have Ss talk about famous football players they know and ask them who they think is the best football  player.\nSpeaking\nACTIVITY 4\nAim: To help Ss practise reading and understand fact files of famous sportspeople.\n-  Ss work by themselves and read the fact files of two famous sportspeople. T may ask them whether  they know these sportspeople, and what else they know about them.\n- Explain any new words to Ss if necessary. Make sure Ss understand everything and they can use these  facts to prepare for the next speaking activity.\nACTIVITY 5\nAim: To help Ss practise speaking about a famous sportsperson in 4.\n-  Have Ss work in pairs or groups. Have them take turns to talk about their chosen sportsperson.\n- Let them have freedom to choose what information to mention. (They can skip some points, or add  some of their own.)\n-  While Ss are talking, T goes round the class and monitors. Remember not to stop them in order to  correct their mistakes.\n- When the talking time is over, T collects common errors and discusses them with the whole class.  Further practice:\n-  If There is enough time, have Ss work in pairs. One student is an interviewer and the other is a famous  sportsperson. Ss role-play an interview.\n- Tand Ss can brainstorm possible interview questions before the activity.\nWRAP-UP\nHave Ss summarise what they have learnt in the lesson with the two skills."
            },
            {
              "id": "5d67afa9-ef9f-44a5-9dfa-1f7ab5e8e6f9",
              "name": "SKILLS 2",
              "content": "Listening\nACTIVITY 1\nAims:\n-  Toactivate Ss’ knowledge of the topic of the listening text;\n-  To help Ss develop the skill of listening for general information.\n-  Play the recording once only. Ask Ss to listen and say who are mentioned in the passages.\n-  Confirm the correct answer as a class.\nKey: The listening passages are about Hai and Alice.\nACTIVITY 2\nAim: To help Ss develop their listening skill for specific information (scanning).\n- Ask Ss to read the sentences carefully and find the key words.\n-  Play the recording again. Tell Ss that while they listen, they have to tickT or F for each sentence.\n-  Call on some Ss to read the answers and explain their choice.\n-  Confirm the correct answers as a class.\nKey:1.F \t2.T \t3.T \t 4.T \t5.F\nACTIVITY 3\nAim: To help Ss develop their listening skill for specific information (scanning), and identify the  exact words to fill the blanks.\n- Ask Ss to read the sentences and find the key words.\n-  Play the recording a third time (or more if needed). Tell Ss that they have to identify the exact words in  the listening passages to fill the blanks, and that the words must be spelled correctly. Ss can share their  answers in pairs before listening to the recording a final time to check the answers as a class.\nKey: 1. volleyball\t 2. three \t3. Alice \t\t4. chess\nAudio script:\nHello. My name's Hai. | love sport. | play volleyball at school and | often go cycling with my dad at the  weekend. But my favourite sport is karate. | practise it three times a week. It makes me strong and  confident.\nMy name's Alice. I'm twelve years old. | don’t like doing sport very much, but | like watching sport on TV.  My hobby is playing chess. My friend and | play chess every Saturday. | sometimes play computer\ngames, too. | hope to create a new computer game one day.\nWriting\nACTIVITY 4\nAims:\n-  Tohelp Ss practise asking and answering questions about their favourite sports and games;\n-  To help Ss brainstorm ideas for their writing.\n-  Have Ss work in pairs and talk about the sport / game they like. They can use the cues given or their  own ideas.\n-  Ask them to note down the important and interesting things in their notebooks.\n-  Go around and give help if necessary.\n-  Call on some Ss to read their notes in front of the class. T and other Ss listen and make comments.\nACTIVITY 5\nAim: To help Ss practise writing a paragraph about the sport / game they like.\n-  Ask Ss to write a paragraph about the sport / game they talk about in 4. Allow Ss to refer to the  listening passages and other sections for useful language for writing. Note interesting expressions and  language on the board.\n-  Tell Ss to write a draft first, based on the ideas they have talked about in 4. Then Ss actually write a  paragraph of 40 - 50 words (or more if they can), covering as many ideas as possible. Tell them to pay  special attention to punctuation, structural elements, linking words, etc.\n- T may collect some $s’ writings and mark them, then give comments to the class. Remember to tell  them how to improve their writings."
            },
            {
              "id": "fc3534e2-4267-435e-a97d-5bbfd1bab6d3",
              "name": "LOOKING BACK",
              "content": "As usual, this is the review and drill section of the unit, so encourage Ss not to refer back to the unit pages.  Instead, they can use what they have learnt during the unit to help them answer the questions. Ss need  to see how far they have progressed and which areas need further practice.\nThe answers to the questions in Looking Back match the Now I can... self-assessment statements at the  end. Ss should check how well they did at each question and use that information when filling the self assessment table.\nVocabulary\nACTIVITY 1\nAim: To help Ss revise the vocabulary items they have learnt in the unit.\n-  Ss do this task individually.\n-  Call on some Ss to read the answers aloud.\n-  Confirm the correct answers as a class. Have the whole class read the words / phrases correctly.\nKey: 1.C \t2.A \t3.C \t4.B \t5.B\nACTIVITY 2\nAim: To help Ss revise the combination of the verbs play, do and go with names of different  sports / games.\n-  Tell Ss that in English sports and games may go after one of three verbs: play, do and go. Ss have to  remember these combinations.\n-  Allow Ss time to do the task individually.\n-  Callon some Ss to write the answers on the board. Then have the class comment, and give them the  correct answers.\n-  T may call on some Ss to read the sentences.\nKey:\n1.do \t\t2. is playing \t\t3. goes\n4. went \t\t5. played \t\t6. are doing\nGrammar\nACTIVITY 3\nAim: To help Ss revise the use of the past simple tense in context.\n-  Have Ss work in pairs and put the verbs in brackets in the correct form of the past simple.\n-  Tell Ss to pay attention to the point of time given in the sentences.\n-  Check their answers as a class.\nKey: 1. took \t\t2. started \t\t3. didn't like \t\t4. did you do; cycled; watched\nACTIVITY 4\nAim: To help Ss revise the use of imperatives (positive and negative) in different situations.\n-  Give Ss some time to work by themselves. Ask them to revise how to use imperatives (positive and  negative) in these situations.\n- Call on some Ss to read their sentences.\n- Have other Ss give comments. T confirms the correct sentences.\nKey:\n1. Please stop making noise.\n2.Go out to play with your friends.\n3. Don't feed the animals.\n4. Stand in line, boys!\n5. Don't touch the dog.\nACTIVITY 5\nAim: To help Ss revise the vocabulary related to sports / games in context.\n- Ask Ss to do the task individually first. Then they can check their answers with a partner before  discussing as a class.T gives corrections.\n-  Have some Ss read the whole passage aloud (maybe sentence by sentence). The rest of the class should  track the text with their fingers as the other Ss read.\nKey: 1. play \t2. hear\t\t 3. favourite \t\t4. sports \t\t5. famous\nWRAP-UP\nAsk Ss what they have learnt in Unit 8. Have them recall the important elements:\n- words / phrases and combinations related to the topic Sports and Games;\n-  sounds /e/ and /e/;\n-  the past simple;\n-  imperatives."
            },
            {
              "id": "4a82f8c3-15d1-466e-94c3-72d8cc3afbc9",
              "name": "PROJECT",
              "content": "ACTIVITY 1\nAim: To introduce to Ss the traditional team game Blind man’s buff.\nHave Ss read the information about a traditional game carefully. Explain new words and anything difficult  to Ss. Make sure they understand everything thoroughly: the equipment and location, the rules and  different steps.\nACTIVITY 2\nAim: To help Ss practise writing about a traditional game.\nEach student chooses one of the games given and writes about it, basing themselves on the information  int:\n- Name of the game:\n-  Number of players:\n-  Equipment:\n-  Howto play:\nACTIVITY 3\nAim: To help Ss practise talking/ giving presentation about a traditional game.\nHave Ss work in groups of 4 or 5. Let each of them present their talk to the group. T and other Ss make  comments.\nNOW I CAN...\nAsk Ss to complete the self-assessment table. Identify any difficulties / weak areas and provide further  practice as needed."
            }
          ]
        },
        {
          "id": "c40c8444-54cc-493f-9865-0ef488472f57",
          "name": "Unit 9 CITIES OF THE WORLD",
          "lessons": [
            {
              "id": "a61d601f-5ae4-4b84-8562-721e56080f35",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n-  use the words related to cities and landmarks;\n-  pronounce the sounds /au/ and /av/ correctly;\n- use possessive adjectives and possessive pronouns;\n-  express exclamations with What;\n-  read for general and specific information about a holiday postcard;\n- talk about a city;\n-  listen for specific information about a description of a city;\n- write a holiday postcard.\nWARM-UP & INTRODUCTION\nAims:\n- To create an active atmosphere before the lesson;\n-  To lead into the new unit.\nReview the previous unit before Ss open their books. Organise a short Guessing  game to revise the names and actions of sports / games. E.g. T can call on some Ss to mime playing a sport or game (cycling a bike, playing table tennis, swimming, etc).  The class guesses what sport / game it is and say the name. Continue with the sports /  games Ss have learnt from Unit 8.\nThen write the title of Unit 9 on the board. Ask Ss to name some cities they know, and  where they are. Ask them to locate the cities on a (big) map and say what they know  about these cities. Sometimes, accept Vietnamese if Ss cannot say it in English.\nAsk Ss what the conversation might be about. Have Ss open their books and check  their answers.\nWHAT NICE PHOTOS!\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n-  To introduce the topic of the unit.\n-  Set the context for the introductory text: Ask Ss to look at the title of the conversation and the picture.  Ask them some questions like: What do you think Mai and Tom are talking about? What cities can you  recognise from the photos? What are they famous for? etc.\n- Encourage Ss to give their answers, but do not confirm whether their answers are right or wrong.\n-  Play the recording twice for Ss to listen and read along. Have Ss underline the words that are related to  the unit’s topic while they are listening and reading.\n-  Invite some pairs of Ss to read the dialogue aloud.\n-  Have Ss say the words in the text that they have underlined. Quickly write the words on one part of  the board.\nACTIVITY 2\nAim: To help Ss identify the location of the cities mentioned in the conversation on a map.\n- Asks if they know which country each city isin. If needed, help Ss by writing the names of the countries  and the cities on the board.\n-  Have Ss look at the map and do the task.\n-  Check their answers as a class.\nKey: 1. New York \t2. London \t\t3. Sydney\nACTIVITY 3\nAim: To help Ss focus on the use of adjectives to describe cities.\n-  Ask Ss to work independently. Ask them to look back at the conversation and find where the names of  the cities appear and what adjectives are used to describe them. Underline them.\n-  Have Ss share their answers and discuss.\n-  Check their answers as a class.\nKey: 1.c,d\t\t2a \t\t3.b,e\nACTIVITY 4\nAim: To help Ss visualise some landmarks of the cities mentioned in the conversation.\n-  Ask Ss to find the word landmark in the conversation and ask them what it is.\n(Tom:... Can you see Big Ben?\nMai: Yeah... on the River Thames. It’s a landmark of London.)\n- Write the word landmark on the board and ask if they can guess the meaning of the word. (Emphasise:  a place / object that is famous in a city. Tourists want to see it.)\n-  Have Ss do the matching.\n-  Allow them to discuss in pairs or groups.\n-  Check the answers as a class.\nKey:1.c \t\t2.d \t\t\t3.a\nACTIVITY 5\nAim: To give Ss a fun time revising what they have learnt so far in the lesson.\n-  Demonstrate by calling three Ss to read the example.\n-  Then allow Ss some time to work in groups.\n- Go round and offer help if needed. Encourage Ss to talk about other cities they know.\nWRAP-UP\n-  Ask one or two Ss to tell the class what they have learnt.\n- Ask Ss to say aloud some words they remember from the lesson.\n-  If there is a visualiser in the classroom, show the dialogue, highlight the key words related to the topic.  It would be helpful if T also highlights in the dialogue possessive adjectives and possessive pronouns  at the end, and tells Ss that they will learn these language points in the following lessons."
            },
            {
              "id": "ba9fc6dd-edb9-4ff9-8d47-93a8026454fa",
              "name": "A CLOSER LOOK 1",
              "content": "Vocabulary\nACTIVITY 1\nAim: To teach Ss some adjectives describing a city.\n-  Check if Ss remember which cities Mai and Tom were talking about at the beginning of the unit. Ask  them how Tom described the three cities. Write the words on the board.\n-  Allow Ss some time to read the adjectives in the box first. Most of them they may already know (maybe  except the word helpful, but don’t explain it yet).\n- Ask them to choose and write the words in the web. Allow Ss to work together if they would like to.\n-  Check answers as a class.\n-  Have Ss practise reading the adjectives.\n- If time allows, encourage them to use these words (or the words they know) to describe other cities in  Viet Nam or abroad.\nNote: If Ss cannot guess the meaning of the word helpful by now, T can give the Vietnamese equivalent.\nKey:\ncity: old, exciting\nfood: tasty, delicious\npeople: friendly, helpful\nweather: rainy, sunny\nACTIVITY 2\nAim: To help Ss use the adjectives in 1 in context.\n-  Ask Ss to work independently.\n- Ask Ss to read the sentences carefully and complete them with the words in 1. Go around and offer  help if needed.\n-  Check their answers as a class.\nKey: 1. sunny \t\t2. old \t\t3. exciting \t\t4.friendly \t\t5. delicious / tasty\nACTIVITY 3\nAim: To teach Ss some words / phrases related to a city.\n-  Ask Ss to read the words / phrases.\n- Ask Ss to write the words / phrases under the correct pictures. (Ss can easily do the task since they  know all the words except stall. The only word and picture left go together).\n-  Check their answers as a class.\nKey: 1. palace \t\t2. floating market \t\t3. street food\t\t 4. stall\nPronunciation\n/3u/ and /au/\nACTIVITY 4\nAim: To help Ss identify and practise the /au/ and /aU/ sounds.\n-  Demonstrate the two sounds with the words cold and our. Write them on the board and say them aloud.\n-  Have Ss read and put the words in the correct columns first.\n- Ask them to listen to the recording, check their answers and complete what they have not been able  to do yet.\n- Play the recording again for Ss to repeat.\n-  Check their answers as a class.\n-  Call on some Ss to read the words aloud.\nKey:\nAudio script:\nboat \t\thouse\t\t town \t\ttower\npostcard \tcrowded \tcoast \t\tpagoda\nACTIVITY 5\nAim: To help Ss practise the sounds /su/ and /av/ in sentences.\n-  Allow Ss some time to read the sentences by themselves first. They can read silently or aloud.\n-  Play the recording. Have Ss listen and repeat the sentences.\n-  Provide further practice by dividing the class into two groups. Have the groups read alternate lines.\n-  Check by asking Ss to read loudly each underlined word in the sentences.\n-  If time allows, ask Ss to make sentences with words containing /au/ and /au/ sounds and practise  saying them in pairs.\nAudio script:\n1. The town is crowded at the weekend.\n2. There's lots of snow in Tokyo in winter.\n3. It’s very cold on the boat.\n4. He's running around the house.\nNote:\n/930/: snow, Tokyo, cold, boat\n/av/: town, crowded, around, house\nWRAP-UP\nAsk Ss to summarise what they have learnt in the lesson."
            },
            {
              "id": "e89f71d1-85f0-4940-9282-8a125f648861",
              "name": "A CLOSER LOOK 2",
              "content": "Grammar\nPossessive adjectives\nAsk Ss to read the Remember! box. This is just a reminder since Ss have already learnt the possessive  adjectives in primary schools. Help if they have any questions.\nIf needed, revise the forms of the possessive adjectives. Use the table below for both possessive adjectives  possessive pronouns.\nACTIVITY 1\nAim: To help Ss revise the use of possessive adjectives.\n- Ask Ss to read the sentences first. Tell them to pay attention to the underlined phrases containing the  possessive adjectives.\n-  Have Ss do the matching.\n-  Check Ss’ answers as a class.\n-  Then draw Ss’attention to the underlined parts of the sentences. Ask them to circle the subjects of the  sentences.\n-  Write on the board the subjects and the possessive adjectives in pairs. (E.g. Sue -  her, Billy -  his,  The cat -  its, We -  our, They -  their) Don't erase them from the board.\nKey:1.d\t\t 2.e \t\t3.b \t4.a \t\t5.c\nACTIVITY 2\nAim: To give Ss opportunities to use possessive adjectives correctly in context.\n-  Allow Ss to do the task individually or in pairs.\n-  Ask Ss to read the pair of sentences carefully and find the subject in the first sentence which will  determine the possessive adjective to be used to complete the second sentence (e.g. | -  my,  The lion -  its).\n-  Allow Ss to swap their answers and have a discussion.\n-  Checks Ss’ answers as a class.\nKey: 1. My \t2. your\t\t 3. Its \t\t4. Her \t\t5. Our\nPossessive pronouns\nWrite the example in the Remember! box on the board. Use arrows that point my book to mine and  your book to yours so that Ss can see how the phrase of a possessive adjective + noun is replaced by a  possessive pronoun.\nACTIVITY 3\nAim: To help Ss determine the correct possessive pronoun representing a phrase.\n-  Ask Ss to read the first sentence of each question carefully and underline the words / phrases which  determine the possessive pronoun for the second sentence. Then complete the second sentence.\n-  Allow Ss to swap their answers.\n-  Call on some Ss to read aloud their answers.\n-  Check Ss’ answers as a class.\nKey: 1. mine \t\t2. theirs \t\t3. yours \t\t4. his \t\t5. ours\nACTIVITY 4\nAim: To help Ss distinguish and use correctly possessive adjectives and possessive pronouns.\n- This activity mixes the use of possessive adjectives and possessive pronouns.\n-  Have Ss do the task individually.\n-  Check Ss’ answers as a class.\nNote:T may give Ss some tips for this exercise. If there is a noun following, it’s the place for a possessive adjective. If not, it’s the place for a possessive pronoun.\nKey: 1. its \t\t2. yours \t\t3. his \t\t4. Our \t\t5. their\nACTIVITY 5\nAim: To give Ss a more difficult task to decide what possessive pronoun / possessive adjective to  use for each sentence.\n- Ask Ss to work individually or in pairs. Ask them to read the sentences carefully and choose the correct  answers.\n-  Check their answers as a class.\nKey:1.B \t2.A \t3.B \t\t4.B \t\t5.B\nWRAP-UP\n-  Summarise the main grammar points of the lesson.\n-  Say aloud sentences containing genitive cases and possessive adjectives (e.g. Hoa’s hat, our class, etc.)  and Ss respond with possessive pronouns.\nEg.\nT: This is Tan's book.\nSs: That book is his."
            },
            {
              "id": "af63b3a3-c5e6-4c7b-9c50-8d062928b621",
              "name": "COMMUNICATION",
              "content": "Everyday English\nExpressing exclamations with What\nTell Ss that they are going to learn how to make an exclamation with What to express their appreciation  or surprise.\nACTIVITIES 1 + 2\nAims:\n- To introduce exclamations with What;\n- To help Ss practise making exclamations with What.\n-  Ask Ss to look at the picture and read the exclamations. Ask them to find the similarity /similarities  among the three exclamations. To help them, write the three exclamations on the board since it is  easier for Ss to observe. (They all begin with What followed by a noun phrase. An exclamation mark (!)  is usually put at the end.)\nPresent the sentences like the following.\n1. What a nice city!\n2. What a clear sky!\n3. What tall buildings!\nWhat + adj + noun + exclamation mark (!)\nAudio script:\n1. What a nice city!\n2. What a clear sky!\n3. What tall buildings!\n2 Allow Ss to work in pairs and take turns to make exclamations about the picture. Call on some pairs to  say their exclamations aloud in front of the class. Check and correct if needed.\nKey:\n1. What happy and beautiful children!\n2. What a colourful and nice picture!\n3. What sunny and beautiful weather!\n4. What a small and cute boy!\n5. What beautiful and colourful apple trees!\nNote: It’s fine if Ss use only one adjective for their exclamations.\nCity landmarks\nACTIVITY 3\nAim: To help Ss get used to some famous landmarks in big cities.\n-  Show Ss photos of the four landmarks of different cities and ask Ss what they are. If Ss do not know  their names in English, allow them to use Vietnamese.\n-  Have Ss work in pairs. Ask them to read the names in the box (make sure that they pronounce the  names correctly) and write them under the correct pictures of the landmarks.\n-  Check Ss’ answers as a class.\n-  Elicit from Ss any information they know about the landmarks: Which cities are they in?\nKey: 1. Merlion \t\t2. Big Ben \t\t3. Sydney Opera House \t\t4. Eiffel Tower\nACTIVITY 4\nAim: To help Ss recognise each landmark through its description.\n-  Have Ss read the descriptions about the four landmarks. Set a time limit.\n-  Have them work individually. Ask them to write the names of the landmarks in 3 next to the descriptions.\n- Call on some Ss to give their answers. Ask them to support theirs.\nKey: 1. Big Ben \t2. Sydney Opera House \t3. Eiffel Tower \t\t4. Merlion\nACTIVITY 5\nAim: To check how much Ss know about different cities and their landmarks.\n-  Have Ss work in pairs. Ask them to read the questions and circle the correct answers.\n-  Check Ss’ answers as a class.\n- Give some more interesting facts about each landmark if time allows.\nKey:1.B \t\t2.A \t\t3.C \t\t4A\nWRAP-UP\nHave Ss say what they have learnt in the lesson."
            },
            {
              "id": "8161d05a-befb-407d-88ec-d14eee8562f3",
              "name": "SKILLS 1",
              "content": "If possible, show the class some real postcards. Ask Ss where the postcards were sent from. Ask them to  guess who wrote the postcard, and to whom; when it was written; what it was written about, etc.\nReading\nACTIVITY 1\nAim: To help Ss brainstorm and see if they have any idea about postcards.\nAsk Ss to discuss when people write a postcard and what is written on a postcard. Accept reasonable answers.\nSuggested answers:\n1. When they are away from home, often on holiday or business. They want to tell their family or  friends what they see and do, and how they feel about their experience there.\n2. The sender often writes about his / her stay in a city or country.\nACTIVITY 2\nAim: To help Ss develop their reading skill for general and specific information (multiple-choice).\n- Have Ss look at the questions first. Ask them to underline the key words in the questions. Tell them  these key words will help them find the information more easily in the text.\n-  Have Ss read the postcard and answer the questions individually before discussing as a class.\n- Call on some Ss to read their answers. Encourage Ss to justify their answers.\n-  Check Ss’ answers as a class.\nKey:1.B \t2.A \t\t3.B \t\t4.C\nACTIVITY 3\nAim: To help Ss identify different features of a place.\n-  Have Ss read the text again and do the matching.\n-  Check Ss’ answers as a class.\nKey: 1.b,c \t\t\t2.a,d,e\nSpeaking\nACTIVITY 4\nAim: To help Ss use what they have learnt so far to talk about a city.\n-  Ask Ss to work in groups. Allow each group some time to choose one city they have learnt about in this  unit, or the one they all know / like.\n- Ask Ss to discuss and make notes of the information they want to share with their class. Ask them to  refer to the questions in this activity as suggestions for their notes or they can do it their own way.  Go around and offer help if needed.\nACTIVITY 5\nAim: To help Ss summarise the information they have to organise a short presentation.\n-  Ask Ss to use the notes in 4 to share the information of their city with the class. Make sure they speak  in full sentences.\n- Allow Ss to vote for the most interesting and informative presentation.\nWRAP-UP\nHave Ss summarise what they have learnt in the lesson with the two skills: what words / phrases / sentences  describing cities and landmarks they can remember; how to talk about a city or a landmark."
            },
            {
              "id": "7dd2690b-55b2-4071-b763-ccea949b42d0",
              "name": "SKILLS 2",
              "content": "Listening\nACTIVITY 1\nAim: To help Ss brainstorm about Bangkok.\nTell Ss they will listen to a talk about Bangkok, the capital of Thailand.\n-  Ask Ss the two questions and discuss with them to see what they know about Bangkok or Thailand.\n-  Allow Ss to speak in Vietnamese (sometimes) if they do not have enough vocabulary in English.\n- Ask Ss to look at the photos and say what they see, and if it’s similar to Viet Nam.\nSuggested answers:\n1. Bangkok is in central Thailand.\n2. It's famous for its temples, markets, shopping centres, silk, street food, friendly people, and many\ntypes of entertainment.\nACTIVITY 2\nAim: To help Ss develop their listening skill for specific information (T / F).\n-  Ask Ss to go through the statements (1 - 4) to make sure that they understand them and know what  information they have to catch for the answers. (Ss may underline the key word(s) in each statement.)\n-  Play the recording. Ask Ss to listen and tick the answers.\n-  Callon some Ss to read aloud their answers and correct the false one(s).\n-  Check Ss’ answers as a class.\nKey: 1. F (markets and street food) 2.F (cheap) 3.F(on the river) 4.7 ) 138 Unit 9/ Cities of the World\nACTIVITY 3\nAim: To help Ss develop their listening skill for specific information (gap-filling).\n- Ask Ss to read the questions carefully and determine what information they need to fill the gaps  (numbers, words).\n- Play the recording for Ss to fill the gaps. Ask them to exchange answers in pairs before checking their answers as a class.\nKey: 1. 15,000 \t\t2:5 \t\t3. life \t\t4. delicious\nAudio script:\nBangkok is famous for its markets and street food.\nVisit the Chatuchak, the largest weekend market in the world. There are over 15,000 stalls selling  nearly everything, at cheap prices. It’s only five minutes’ walk from the station. When you visit this  market, you can see part of Thai people's life.\nAnother interesting type of market is the floating market on the river. Don't forget to try street food  in Bangkok. It’s easy to find food stalls all around Bangkok, serving different Thai dishes. They are really delicious.\nWriting\nACTIVITY 4\nAim: To help Ss talk about a holiday city and collect information for their later writing.\n-  Ask Ss to work in groups to choose a city they know and discuss. Tell them to use the questions as a guide.  -  Ask Ss to take short notes of the answers for later use.\n- Go round and help if needed.\nACTIVITY 5\nAim: To teach Ss how to write a postcard.\n-  Ask Ss to use their ideas in 4 to write a postcard to their family.\n- Ask Ss to refer to Reading 2 if needed.\n- If there is time, pair Ss and ask them to write postcards to each other. Have them swap and give  feedback on each other's writing once they have finished.\n- Explain to Ss that there is only limited space for writing on postcards so people often write short  sentences with only key words. Tell Ss that contraction is often used in writing postcards to make them short and informal."
            },
            {
              "id": "14622f92-d933-49bb-8d5e-fd6ad50e12a6",
              "name": "LOOKING BACK",
              "content": "- Encourage Ss to complete Looking Back without referring to the previous sections in the unit.\n- Ask Ss to record their results for each exercise in order to identify the areas they need further review.\nVocabulary\nACTIVITY 1\nAim: To help Ss revise the adjectives used to describe cities and landmarks.\n-  Write the four words: city, weather, people, food on the board and elicit from Ss at least three adjectives  to describe each word.\n-  Give Ss sufficient time to do the task.\n-  Check Ss’ answers as a class.\nKey:1.A,B \t\t2.A,C \t\t3.A,C \t\t4.A,B \t\t5.B,C\nACTIVITY 2\nAim: To help Ss revise the nouns for city landmarks.\n- Ask Ss to read the words in the box first and make sure they remember their meanings. Then allow  them some time to write the words under the correct pictures.\n-  Check Ss’ answers as a class.\nKey:\n1. towers \t\t2. river bank \t\t3. beach\n4. night market \t\t5. palace \t\t6. postcard\nGrammar\nACTIVITY 3\nAim: To help Ss revise the possessive pronouns in context.\n-  Ask Ss to complete the sentences individually. They can share their answers with their partners, but  they should record their original answers to guide their self-assessment later.\n-  Check their answers as a class.\nKey: 1. yours \t\t2. theirs \t\t3. mine \t\t4. Ours \t\t5. hers\nACTIVITY 4\nAim: To help Ss revise the possessive adjectives and possessive pronouns in context.\n-  Write 2 - 3 sentences on the board with similar mistakes to the ones in 4 and have the class do them  together. Explain the answers.\n- Ask Ss to read the sentences carefully and correct the underlined words.\n-  Check their answers as a class.\nKey: 1. its \t\t2. our \t\t3. their \t\t4. its \t\t5.ours\nWRAP-UP\nHave Ss look at the Now I can... table."
            },
            {
              "id": "abc87a85-500d-4506-bf1b-d741c9334458",
              "name": "PROJECT",
              "content": "Aim: To allow Ss to apply what they have learnt (vocabulary and grammar) into practice through  a project.\n-  Divide Ss into small groups of 4 or 5.\n- Ask them to discuss and choose a city in the world they would like to visit.\n- Ask them to look for necessary information for the visit, basically by answering the suggested questions.\n- Summarise the information and report the information collected to the class.\n- Ask the class to listen to the reports and ask questions if they would like to. They may even vote for the  best report.\nNOW I CAN...\nAsk Ss to complete the self-assessment table. Discuss as a class what difficulties remain and what areas  Ss have mastered."
            }
          ]
        },
        {
          "id": "f207e1d1-77a1-4ffd-b85a-d054f4e41aab",
          "name": "REVIEW 3",
          "lessons": [
            {
              "id": "f9546939-3730-4f7f-bc75-97ef18fe0281",
              "name": "LANGUAGE",
              "content": "Objectives:\nBy the end of this review, students will have revised the language they have\nlearnt and the skills they have practised in Units 7-9.\nIntroduction\n- Ask Ss what they have learnt in terms of language and skills.\n-  Summarise their answers in notes and write them in a top corner of the board. Briefly revise some  important / difficult items before starting with the review.\nPronunciation\nActivity 1\nAim: To help Ss review the pronunciation of the sounds learnt in Units 7 - 9.\n- Write the three pairs of sounds on the board: /@/ and /0/, /e/ and /e/, /au/ and /au/. Write one word  containing the sound underneath each of them. Ask Ss to read the words aloud.\n-  Ask Ss to do the task by reading aloud each group and circle the odd one out.\n-  Play the recording for Ss to listen and check their answers.\n-  Check Ss’ answers as a class.\n-  Play the recording again for Ss to listen and repeat in chorus and individually.\nKey:1.C \t2.A \t\t3.A \t\t4.C \t\t5.B\nAudio script:\n1. A. tower B. how Cc. snow,\n2.A. symbol B. opening C. postcard\n3.A. farther B. earth C. both\n4. A. Saturday B. racket C.game\n5.A. tennis B. prepare C. chess\nVocabulary\nActivity 2\nAim: To test Ss’ ability to choose the correct word to be used in context.\n-  Have Ss do this task separately or in pairs.\n-  Ask Ss to read the passage carefully and pause at each blank to decide which word is the best answer.\n-  Guide Ss to look for clues for their answers. E.g. In sentence 1, we have when the weather is good.  It means that these activities depend on the weather. Therefore, the answer must be outdoor.\n-  Ask Ss to exchange their answers with their partners.\n-  Check Ss’ answers as a class.\nKey: 1.A \t2.C \t3.A \t\t4.C \t\t5.C\nActivity 3\nAim: To help Ss review the words / phrases learnt.\n- Ask Ss to read each sentence carefully and choose the correct word / phrase.\n-  Check Ss’ answers as a class.\nKey:1. landmark \t\t2.football\t\t 3.television \t\t4.city \t\t5.Summer sports\nThis is a revision of grammar point taught in the three units: wh-questions, conjunctions, possessive  adjectives, possessive pronouns, the past simple and imperatives.\nActivity 4\nAim: To help Ss revise grammar points mentioned above.\n-  Have Ss do the task individually or in pairs.\n-  Check Ss’ answers as a class. Explain to them how to find the answers.\nKey:1.B \t2.C \t3.A \t4A \t5.C \t6.B\nActivity 5\nAim: To help Ss revise the use of question words.\n-  Ss should be familiar with and good at using question words.\n- T may revise by writing a long sentence on the board. (E.g. Yesterday, | went to the cinema and watched  The Dolphins with my cousins.). Then underline some words and ask Ss what question word they use to  get the answers, which are the underlined words.\n- Ask Ss to open their books to page 36 and do the task individually.\n-  Check their answers as a class. For the wrong one(s), explain why it is / they are incorrect.\nKey: 1.What\t 2. Correct \t3.Why \t\t4.How \t\t5.Where"
            },
            {
              "id": "5ab1c393-1b4a-4f89-a5f1-4405656560ee",
              "name": "SKILLS",
              "content": "Reading\nActivity 1\nAim: To help Ss practise reading for general information.\n- Ask Ss to look at the photos and the names of the sports and ask if they know anything about these  sports. If they don't, ask them to guess.\n- Have Ss read the passages individually and do the matching. Ask them to underline 2 -  3 key words for  their quick answers.\n-  Check Ss’ answers as a class.\nKey: 1. B 2.A\nActivity 2\nAim: To help Ss practise reading for specific information.\n-  Ask Ss to read the questions and the passages again carefully for details for their answers.\n-  Ask Ss to swap their answers with their partners and show where they find the information for their  answers.\n-  Check Ss’ answers as a class.\nKey:\n1. Cheese Rolling \t\t2. Toe Wrestling\n3. Cheese Rolling \t\t4. Cheese Rolling \t\t5. Toe Wrestling\nSpeaking\nActivity 3\nAim: To help Ss practise asking about their likes for cities, sports, and TV programmes.\n- This section, again, revises the vocabulary and grammar items learnt in a more dynamic form:  interviewing and reporting the results.\n-  Ask Ss to take turns to ask the questions and take notes of their partners’ answers. Encourage them to  add more questions with Why, Where, With whom, etc.\n-  Go round and offer help if needed.\n-  Call on some groups to report their results to the class.\nListening\nActivity 4\nAim: To help Ss practise listening for specific information (gap-filling).\n-  Ask Ss to look at the pictures and read the phrases underneath. Ask them if they know what they are.  Make sure they pronounce the phrases correctly (which helps make the listening easier).\nNote: Ss have learnt about Merlion Park in Unit 9 already.\n-  Nowask Ss to read the sentences and determine what information is needed for the blanks.\n-  Play the recording as many times as needed. Allow Ss some time to write the answers.\n-  Check Ss’ answers as a class.\n- Play the recording again and pause when the answers appear if needed.\nKey: 1. visitors \t\t2. slowly \t\t3.35 \t\t4. 30 \t\t5. little\nAudio script:\nSingapore is a small island city-state. It attracts millions of visitors every year. A good way to see  the city is by taking a hop-on hop-off bus. The bus goes slowly around the city. It stops at different  attractions like Chinatown and Merlion Park. You can get off the bus at any place, and then get on  the next bus. The tour costs 35 dollars, and there is a bus every 30 minutes. This kind of sightseeing\nis good for people with little time in the city.\nWriting\nActivity 5\nAim: To help Ss write a paragraph describing a visit to a touristy city, based on the information  provided.\n- Ask Ss to read the information in the table carefully.\n-  Ask them what tense they should use for their writing.\n-  Have Ss write. Go round and offer help if needed. Ss might want to change some details from the table  or the order the information appears. Encourage them to do so.\n-  Call on one or two volunteers to read aloud their answers. Call for other Ss’ comments.\n-  Collect some writing to correct at home.\nSuggested answer:\nLast summer, Mark visited Delhi in India. He spent seven days there. During his holiday, he went  sightseeing around the city. He watched a snake performance, visited some temples, and ate street  food. The people he met were friendly and helpful. The only thing he didn't like was the weather. It was very hot."
            }
          ]
        },
        {
          "id": "845c3259-bffb-4e0b-a78d-9cfec052602c",
          "name": "UNIT 10 OUR HOUSE IN THE FUTURE",
          "lessons": [
            {
              "id": "b6831004-e246-4f61-bbb6-978aa04594b6",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n- use the words related to types of houses and appliances in the house;\n- pronounce the two-syllable words correctly;\n-  use future simple and might for future possibility;\n-  express surprise;\n- read for specific information about houses and appliances in the future;\n-  talk about different houses in the future;\n-  listen for specific information about dream houses;\n- write a paragraph about a dream house.\nWARM-UP & INTRODUCTION\nAims:\n- To create an active atmosphere in the class before the lesson;\n- To lead into the new unit.\nHave Ss play the game Slap the board or Pelmanism to revise the vocabulary items  they have learnt in Unit 9 before starting the new unit.\nWrite the title of the unit Our houses in the future on the board. Have Ss say something  about the houses they are living in and the furniture or appliances they have got.\nTell them to think about the houses and appliances they want in the future.\nMY FUTURE HOUSE\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n-  To introduce the topic of the unit.\n-  Have Ss look at the picture. Have them answer some questions, e.g. Who are they? What is Phong doing?  What are they talking about? Focus on some main information about the conversation (They are Phong  and Nick. Phong is painting a UFO. They are talking about Phong’s house in the future.).\n- Play the recording for Ss to listen to the whole conversation once.\n- Play the recording again, sentence by sentence, for them to listen and repeat. Have them listen and  repeat the conversation more than once, if necessary, until they feel confident.\n-  Have Ss read the conversation in pairs. Draw Ss’ attention to the uses of will (for future) and might (for  future possibility) by underlining the sentences with will and might. Go around and offer help, if necessary.\n-  Get some pairs to read the conversation in front of the class. Check their pronunciation, if necessary.\nACTIVITY 2\nAim: To help Ss understand the conversation.\n- Write on the board Type of house, Location and Appliances in the house. Explain the meaning of the  words: type, location and appliances. Have them repeat the words several times.\n- Work in groups, have Ss read the conversation again and find the words or phrases to show type of the  house, the location of the house and its appliances. Then have some Ss say the words and phrases in  front of the class. Explain UFO (Unidentified Flying Object) if Ss do not know.\n- If there is enough time, ask one student to go to the board and write the words / phrases. Check the  answers as a class.\nKey:\nType of house: UFO\nLocation: in the mountains\nAppliances in the house: some smart TVs and ten robots\nACTIVITY 3\nAim: To help Ss read for specific information about the house and appliances in the house.\n-  Give time for Ss to read the conversation independently again and tick (W) true or false next to the  statements. Ask them to share their answers in pairs before discussing in groups. Encourage them to  correct the false statements.\n- Select one student to give his or her answers in front of the class. Praise them when they give the  correct answers.\nKey:1.T \t2T\t 3.T\t 4.F\nACTIVITY 4\nAim: To help Ss make phrases about places.\n-  Explain that Ss have to order the words to make phrases about places. Remind them that each group  has one extra word. Get them to look at the example to identify how to do the activity.\n-  Have Ss work individually. Ask them to share their answers in pairs before discussing them in groups.  Go around and offer help, if necessary.\n- Then call on some Ss to write their answers on the board. Check their answers and give explanation,  if necessary.\nKey:\n1.in the sea \t\t2. in the city \t3. in the town \t4. in the mountains\n5.in the countryside \t6. on the Moon\t 7. in the sky\nACTIVITY 5\nAim: To help Ss listen and guess the locations of houses in the future from the description.\n- First, ask Ss to read the example and explain how the task is carried out: Ss work in groups.  One group member describes to his / her group what he / she can see outside the window of his / her  future house. The other group members try to guess where his / her house is.\n-  Before doing the task, ask one pair of Ss to read aloud the exchange in the example as a model.\n-  Give Ss time to do the task in groups. Then call on some groups to perform the task in front of the class.  Ask the class to listen and comment.\n- This activity can be organised as a competitive game. The class is divided into teams A and B.  Team A describes and Team B tries to guess. If the guess is correct, they get one point. Then change roles.  The group with the most points is the winner.\nWRAP-UP\n- Ask one or two Ss to tell the class what they have learnt.\n- Ask Ss to say some words they remember from the lesson."
            },
            {
              "id": "4fe79851-14f8-42f5-81ee-fdb994299760",
              "name": "A CLOSER LOOK  1",
              "content": "WARM-UP\n-  Give Ss a few minutes to play Guessing game or Pass the secret to revise phrases relating to locations of  houses, e.g. in the sea, in the city, in the mountains, in the countryside.\n-  Have Ss do Activity 5 on page 39 again to ask and answer questions about locations of houses.\n-  Ask Ss to open their books to page 40.\nVocabulary\nACTIVITY 1\nAim: To help Ss say the words / phrases correctly and put them in the appropriate columns.\n-  Have Ss look at the words and phrases in the box. Check that Ss understand the meanings of all words /  phrases. If not, T may show pictures, give definitions or the Vietnamese equivalents.\n-  Play the recording and have Ss listen to the words and phrases.\n-  Play the recording again with pauses for them to listen and repeat each word or phrase.\n-  Then ask some Ss to read the words and phrases in front of the class. Have the class listen and give  comments.\n-  Have Ss work in pairs to put the words / phrases in the appropriate columns. Explain to Ss that they  may use some words more than once. Ask them to share their answers in pairs before discussing them  in groups.\n- If there is enough time, select one student to write his / her answers on the board. Check the answers  as a class.\nSuggested answer:\nAudio script:\nelectric cooker \t\tdishwasher   \t\twashing machine \t\twireless TV\nfridge \t\t\telectric fan \t\tcomputer \t\t\tsmart clock\nACTIVITY 2\nAim: To help Ss make phrases about how appliances can help us.\n-  Tell Ss to look at the two columns and explain what they can see (e.g. They can see words and phrases  relating to appliances in the first column, and words and phrases relating to what each of the appliances  can help us to do in the second column).\n-  Have Ss do the task individually, by matching the appliances in A with what they can help us to do in B.\n-  Ask them to share their answers in pairs before checking the answers as a class. Then encourage them  to make sentences with matched phrases, e.g. An electric cooker can help us to cook rice.\n-  Call on some Ss to write their sentences on the board. Correct if necessary.\nKey: 1.c \t2.d \t\t3.b \t\t4e \t\t5.a\nACTIVITY 3\nAim: To help Ss ask and answer questions about how appliances can help us.\n--  Ask Ss to read the example first. Ensure that they know what to do. Then have some pairs role-play the  exchange in front of the class. Check pronunciation, if necessary.\n-  Have them work in pairs, one points to the appliance in 2 and asks the question, and the other gives  the answer about the appliance, using the information in 2.\n- Call on some pairs to role-play the exchanges in front of the class. T and other Ss give comments.\nPronunciation\nStress in two-syllable words\nACTIVITY 4\nAim: To help Ss pronounce two-syllable words which have the first syllable stressed.\n- Explain that most two-syllable nouns and adjectives have stress on the first syllable (e.g. housework,  father, brother, pretty, famous, etc.)\n-  Give Ss a few minutes to look at the words. Explain that these words are all two-syllable nouns. The first  syllable of these words is stressed which means it should be pronounced with a louder voice. Draw  their attention to the stress mark on the first syllable.\n- Play the recording several times, if necessary, for Ss to listen and repeat the words. To reinforce  pronunciation, ask them to clap when they say the stressed syllable in the words.\n-  Have Ss practise saying the words in pairs or groups. Go around to offer help or correct pronunciation,  if necessary.\n- Call on some Ss to say the words in front of the class. Check their pronunciation if necessary.\nAudio script:\n‘picture \t‘robot\t\t ‘bedroom \t‘kitchen\n‘housework \t‘palace\t\t ‘village \t‘mountains\nACTIVITY 5\nAim: To help Ss say the sentences with the two-syllable words in which the first one is stressed.\n-  Give Ss a few minutes to read the underlined two-syllable words in the sentences. Encourage some Ss  to read aloud the words in front of the class and ask the others to give comments.\n-  Play the recording, sentence by sentence, for Ss to listen and repeat. Draw their attention to the stress  in the first syllable of the underlined words.\n-  Have Ss practise saying the sentences in pairs or groups. Go around to offer help or correct pronunciation,  if necessary.\n-  Call on some Ss to read aloud the sentences in front of the class. Check their pronunciation if necessary.\n--  Ifthere is time, have Ss make more sentences with two-syllable nouns they know. Then ask them to say  their sentences in front of the class.\nAudio script:\n1. The picture is on the wall of the bedroom.\n2. The robot helps me to do the housework.\n3. There's a very big kitchen in the palace.\n4. Their village is in the mountains.\nWRAP-UP\nHave Ss summarise what they have learnt in this period."
            },
            {
              "id": "5d173fb3-abab-4109-a694-a5e22b980fd6",
              "name": "A  CLOSER LOOK 2",
              "content": "WARM-UP\n-  Give Ss a few minutes to play Pass the secret or Simon says to revise two-syllable words.\n-  Have Ss look at the GETTING STARTED of Unit 10 and find the two-syllable words and say them aloud  in front of the class.\n-  Ask Ss to open their books to page 41 (A CLOSER LOOK 2).\nGrammar\nFuture simple\n- Texplains how the future simple is used (We use the future simple to talk about an action that happens  in the future.) and how it is formed (positive, negative, questions and short answers).\n- Have Ss read the examples in the Remember! box. Draw their attention to the short form ‘ll and won't.\nPositive\n1/We / You / They / He / She /It + will + V\nExamples:\n-  My father will travel on the Moon in a super car in the future.\n-  We'll live in that cottage next year.\n(‘Ilis the short form of will)\nNegative\n1/We / You / They / He / She / It + will not +V\nExample:\nWe won't live in that cottage anytime soon.\n(won't is the short form of will not)\nQuestions and short answers\nWill + 1/ we / you/ they / he / she/ it + V?\nYes, you/ we... will.\nNo, you / we... won’t.\nExample:\nWill they live on the Moon?\nYes, they will.\nNo, they won't.\nACTIVITY 1\nAim: To help Ss use will (‘Il) or won't to complete the sentences.\n-  Have Ss read the instruction to understand how to do the activity.\n-  Have Ss read the example as a guide. Then have them read the sentences and fill the blanks to make  the sentences true for themselves. Go around and offer help, if necessary.\n-  Ask Ss to exchange their answers in pairs or groups. Then call on some Ss to say out their answers in  front of the class. Check their answers.T explains if necessary.\nKey: Ss' own answers\nACTIVITY 2\nAim: To help Ss use will (‘Il) or won't to complete the conversation.\n- Have Ss read the open conversation in pairs first. Then ask them to do the task individually. Remind  them of the use of will (‘Il) or won't after he and we. Go around and offer help, if necessary.\n- Ask Ss to exchange their answers in groups. Then call on some Ss to say out their answers in front of the  class. T confirms the correct answers and gives explanation if necessary.\n-  Have Ss read again the complete conversation in pairs. T observes and corrects Ss’ pronunciation and\nverb forms, if necessary.\nKey: 1. will ('ll) \t2. will \t\t3. will (‘Il) \t\t4. won't \t\t5. will (‘Il)\nACTIVITY 3\nAim: To help Ss write sentences about how appliances will or won't help us in our future houses.\n-  Have Ss read the instruction of the activity to understand what they are going to do.\n-  AskSs to write sentences, using will (Il) or won't and the words provided.\n-  Give Ss time to do the task individually.\n-  Get them to swap their answers in pairs or groups. Go around and offer help, if necessary.\n- If there is time, have some Ss write complete sentences on the board. T and other Ss make comments.  Check the answers as a class.\nSuggested answers:\n1. A computer will / won't help me to do my housework.\n2. A robot will help me to water the flowers.\n3. A smart TV won't help me to cook meals.\n4. A washing machine will / won't help me to iron the clothes.\n5.A smartphone won't help me to take care of the children.\nMight for future possibility\nT explains how might + Vis used (We use might + V to talk about actions that are possible in the future - we  are not sure if the actions will happen) and how it is formed (affirmative: | / we / they / you / he / she / it  + might + V; and negative: | / we / they / he / she / it + might not + V). Then have Ss read the examples in  the Remember! box.\nACTIVITY 4\nAim: To help Ss understand how might is used in a real context.\n-  Ask Ss to read the poems individually and underline all the phrases might +V.  -  Have Ss do the task and share their answers together.\n-  Invite one or two Ss to say out their answers in front of the class, then check the answers as a class.\nKey:1.T \t2.T\t 3.F \t4.F \t5.T \t6.F\nACTIVITY 5\nAim: To help Ss say what they might have or do in the future.\n-  Have Ss read the instructions of the activity to understand what they are going to do.\n- Ask Ss to read the example and ensure that they know what to do. Then ask them to work in groups.  Have them discuss what they might or might not have / do in the future.\n-  Then ask Ss to tell their partners about them. T goes round and corrects mistakes or gives help when  necessary.\n-  Call on some $s to share their ideas in front of the class. T and other Ss give comments.\nWRAP-UP\n- Summarise the main points of the lesson.\n- Ask Ss to make sentences about themselves, using the future simple."
            },
            {
              "id": "cd59464f-21a1-4b3d-96f8-e0a7c4183aec",
              "name": "COMMUNICATION",
              "content": "WARM-UP\n-  Give Ss a few minutes to play Guessing game or Pass the secret to revise sentences relating to what  appliances will help them to do in their future houses.\n-  Have Ss do Activity 3 on page 41 again to reinforce phrases relating to what appliances can help us to  do in the future houses.\n- Ask Ss to open their books to page 43 (COMMUNICATION).\nEveryday English\nExpressing surprise\nACTIVITIES 1 + 2\nAim: To provide Ss with the way of expressing surprise.\n1\n- Play the recording and have Ss listen and read the conversation at the same time. Then have them read  the conversation sentence by sentence. Draw their attention to the highlighted sentences. Elicit the  structure to express surprise from Ss (Wow! Is that + object? It looks + adjective).\n-  Ask them to act out the conversation in pairs. Go around and offer help, if necessary. Check their\npronunciation.\nAudio script:\nDavid: John! Hello!\nJohn: Oh, hi, David. Wow! Is that your computer? It looks great.\nDavid: Yes, it's my new computer. My parents gave it to me for my birthday.\n2\nHave Ss work in pairs, one expresses his / her surprise when he / she sees the other's new things (watch,  TV, mobile phone, shoes, etc.). Ask Ss to use the structure to express surprise in 1.\nE.g.\nA: Wow! Is that your mobile phone? It looks great.\nB: Yes, it’s my new mobile phone. My grandparents gave it to me for my birthday.\nHouses and appliances in the future\nACTIVITY 3\nAim: To help Ss identify tasks that appliances can help them to do in the future houses.\n-  Have Ss read the questions and explain the new words or phrases (e.g. hi-tech, in space, look after, etc.)  if necessary. Then have them answer the questions by ticking W) \"Yes\" or“No\".\n-  If time allows, T asks the questions again and have Ss look at the boxes of “Yes” or “No” and give their  own answers.\n- Ask one or two Ss to look at the answers and tell about houses and what appliances will help them to  do in future houses. E.g. Hi. My name’s Hoa. In the future, I'll live ina hi-tech house. It'll be in the mountains.  I'll have lots of trees and flowers around my house. I'll have a fridge that can cook meals for me...\nACTIVITY 4\nAim: To help Ss practise asking and answering questions about houses in the future.\n-  Have Ss read the conversation in the example. Draw their attention to the type of house (question 1) and  its location (question 2 and 3) and how the questions are used.\n-  Ask Ss to work in pairs and use the information from 3 to role-play. To add more variety to the  conversation, Ss may add the questions about appliances that the house will have and what these  appliances will do for them.\nEg.\nA: Will your house have a fridge?\nB: Yes, it will.\nA: What will it do for you?\nB: It will cook my meals.\n- Ask some pairs to role-play in front of the class. T and other Ss give comments.  ~ If time allows, have Ss work in groups, discussing the main content of the conversations they have  just practised.\nEg.\nType of the house: cottage\nLocation: in the mountains\nSurroundings: trees, flowers and mountains\nAppliances: robot (look after the children), fridge (cook meals), computer (send and receive emails), etc.\nACTIVITY 5\nAim: To help Ss talk about houses and appliances in the future.\n- Ask Ss to read the example to understand how to explain the interview in 4.  -  AskSs to take notes of their partner's answers in 4 as follows:\nEg.\nType of the house: UFO\nLocation: in space\nSurroundings: planets\nAppliances: robot (look after the children), fridge (cook meals), computer (send and receive emails), etc.\n-  Call on some Ss to tell the class about their partners’ future houses, using the notes they have written.  T and other Ss listen and make comments.\n- To add more variety to the interview, T may ask Ss to add some more information. E.g. Hello. I'd like to  tell you about Nam's house and appliances that will help him to do things in his house... His future house  will be a hi-tech house. It'll be.... He might have a robot to help him with his home. Thank you for listening.\nWRAP-UP\nHave Ss tell you what they have learnt (the way of expressing surprise)."
            },
            {
              "id": "71433205-dd9e-4a96-8b0c-fd7e38894135",
              "name": "SKILLS 1",
              "content": "WARM-UP\n-  Ask a few Ss to go to the board and tell class about houses and appliances in the future. The class  listens and gives comments.\n-  Have Ss open their books to page 44 (SKILLS 1).\nReading\nACTIVITY 1\nAim: To help Ss understand their knowledge of the topic.\n- Ask the class to look at the picture first. Encourage them to focus on the details / ideas of the picture  (type of house, location, surroundings and appliances).\n-  Ask Ss to work in pairs, asking and answering the questions provided.\nEg.\nA: What type of house do you think it is?\nB: | think it’s a villa.\nA: Where do you think it is?\nB: | think it’s on an island.\n-  Call on some pairs to role-play in front of the class. The class makes comments.\nACTIVITY 2\nAim: To help Ss read for specific information about the house and its appliances in the future.\n-  Set a time limit for Ss to read the text individually. Help them understand the text by giving the meanings  of the difficult words, or explanations, or the Vietnamese equivalents. Tell them to pay attention to  what the robots and the super smart TV will do. T may ask them to underline the structures or phrases  relating to what the robots will do and double-underline the structures or phrases relating to what the  super smart TV will do.\n-  Ask Ss to match the beginnings in A with the endings in B. Go around and offer help, if necessary.\n- Ask Ss to work in pairs to exchange their answers first. Then call on some Ss to read their answers and  give explanation for their choice. Confirm the correct answers as a class.\nKey: 1.a,C,e,9,h \t2.b,d,f\nACTIVITY 3\nAim: To help Ss develop their reading skill for specific information.\n- Ask Ss to read the incomplete sentences and guess the option (A, B, or C) to fill the blanks.  Explain that this task helps them focus on the information they are going to find in the text.\n-  Set a longer time limit for Ss to read the text again. Ask Ss to note or underline where they find the  information that helps them circle the option (A, B, or C) to complete the sentences.\n-  Have Ss compare the answers in groups before discussing them as a class.\nKey: 1.B \t2.A \t3.C \t4B\nSpeaking\nACTIVITY 4\nAim: To help Ss ask and answer questions about different houses in the future.\n- Have Ss read the instructions to identify how the task is done.\n-  Have Ss read the suggested questions and then think of the answers to these questions. Draw their  attention to the type of future house (Question 1), its location (Question 2), its appearance (Question 3),  etc. Then tell them that they have to imagine their future houses in order to answer the questions.\n-  Have them work in pairs, asking and answering questions about their future houses. T may ask Ss to  refer back to the passage in 2 and the conversation in GETTING STARTED. T goes round and corrects  mistakes or gives help when necessary.\n- Call on some pairs to perform the task in front of the class. T and other Ss listen and make comments.\nACTIVITY 5\nAim: To help Ss talk about different houses in the future.\n-  Have Ss read the example toidentify how to do the task. Then have them tell their partners about their  future houses using the information they have discussed in 4.\n- Encourage some Ss to speak in front of the class, the class comments on their classmate’s content,  pronunciation, fluency, language (grammar, use of words, etc.), body language. T can help the class  give feedback.\nWRAP-UP\nHave Ss summarise what they have learnt with the two skills."
            },
            {
              "id": "8b619a83-1b7f-41ea-aa27-cdfd6a3c8f81",
              "name": "SKILLS 2",
              "content": "WARM-UP\n-  Invite a few Ss to go to the board and tell the class about different houses in the future.\n-  Ask them to open their books to page 45 (SKILLS 2).\nListening\nACTIVITY 1\nAim: To help Ss have the ideas of what the conversation is about.\n- Ask Ss to look at the pictures and elicit from Ss the details (types of house, surroundings and locations).  Ask Ss the houses they like and why they like them.\n- Ask Ss to focus on the task they have to do.\n- Play the recording. Ask Ss to listen and write the speakers’ names under the correct pictures.  T checks their answers.\n-  If it’s necessary, play the recording again and pause the recording after each sentence.\nKey:\nLinda: Picture ¢ (a villa by the sea, with a swimming pool and a garden)\nNick: Picture a (a flat in the city)\nACTIVITY 2\nAim: To help Ss listen for specific information about dream houses.\n- Ask Ss to read the information in the first column. Ask them to focus on the information they need only  (what are important to Linda and Nick: park view, city view, etc.).\n-  Play the recording again. Ask Ss to listen and tick what are important to Linda and Nick. Call on some  Ss to give the answers to the class and correct mistakes where necessary.\nKey:\nLinda: sea view, swimming pool, garden\nNick: park view, city view\nACTIVITY 3\nAim: To help Ss listen for specific information about dream houses.\n-  Ask Ss to read the questions and underline the key words. Then have them listen to the recording again  and answer the questions in pairs or groups.\n- Aska few pairs to role-play in front of the class, one asks the questions and the other answers. Other  pairs andT listen and comment.\nExtension: Have some Ss talk about dream houses of Linda or Nick, using the information in 2 and 3.  E.g. Hi. Let me tell you about Linda’s dream house. It is a big villa by the sea. It has a view of the sea. There's a  swimming pool and a garden around her house... Thank you for listening.\nKey:\n1. She has a big villa.\n2. Her house / It is by the sea.\n3. There’s a swimming pool anda garden around her house.\n4.He hasa flat.\n5. It’s in the city.\nAudio script:\nNick: Can you tell me about your dream house, Linda?\nLinda: Well, it's a big villa by the sea. It has a view of the sea. It has a swimming pool and a garden.  Nick: My dream house is different.\nLinda: Really? What's it like?\nNick: It’s a beautiful flat in the city. It has a park view in front and a city view at the back.  Linda: Oh, sounds great!\nNick: It has a super smart TV. | can watch films from other planets.\nLinda: That sounds great, too. But | think it'll be ...\nWriting\nACTIVITY 4\nAim: To help Ss brainstorm ideas for a dream house.\n- Have Ss look at the table. Draw their attention to the four pieces of information. Then have them read  the exchange in the example to understand how to do the task.\n- Ask Ss to work in pairs to ask and answer the questions and fill the table. Call a student to write the  answer on the board. Others write it in their notebooks.\nACTIVITY 5\nAim: To help Ss write a paragraph of about 50 words about a dream house.\n-  Allow Ss time to write a paragraph (about 50 words) about their dream houses, using the suggested  ideas / information in 4.\n-  When they finish, ask some Ss to explain their dream houses to the class.\n- If time allows, call on one student to write his / her answer on the board. The class gives their comments.\nSample paragraph:\nMy dream house is a big palace. It is in the mountains. It is surrounded by lots of trees. It has seven rooms:  three bedrooms, two bathrooms, one kitchen and one living room. There is a large swimming pool in  front of it. | have some robots in the palace. They help me to clean the floor, cook meals, water flowers...\nlam happy to live in my palace."
            },
            {
              "id": "bbdd2df1-ac05-4ad3-b0ca-c28ef6ba0de1",
              "name": "LOOKING BACK",
              "content": "WARM-UP\n- Aska few Ss to go to the board and tell the class about their dream houses.\n- Encourage Ss not to refer to the unit pages. Ask them to keep a record of their answers to each task so  that they can use their information to complete the self-assessment table at the end of the unit.\n-  Have them open their books to page 46 (LOOKING BACK).\nVocabulary\nACTIVITY 1\nAim: To help Ss revise the words relating to appliances in the future.\n- Tell Ss to read the words in the box first. Then ask them to write the words in the box under  the pictures.\n-  Give them time to do it individually. Then compare their answers with their partners.\n-  Asksome Ss to read the words aloud. Then T checks their answers as a class.\nKey:\na. computer\t\t b. dishwasher \tc. wireless TV\nd. washing machine\t e. fridge \t\tf. smart clock\nACTIVITY 2\nAim: To help Ss review the phrases about what the appliances will do in the future.\n- Have Ss work in pairs or groups, discussing what each appliance will do in the future and fill in the  blanks in the table.\n- Call on some Ss to tell the class about their answers. E.g. | think robots will look after my future house.  T and other Ss listen and make comments.\nGrammar\nACTIVITY 3\nAim: To help Ss revise the use of the future simple in sentences.\n-  Have Ss read the instruction to know what they have to do. Draw their attention to some complex  sentences with subordinate clauses of time (sentences 2, 4, 5). T may explain these sentences if necessary.\n- Ask Ss to complete the sentences with will (‘I/) or won't individually first. Then, they can check their  answers with a partner before discussing them as a class.\nKey: 1. won't\t\t 2. will\t\t 3. will\t\t 4.won't\t5. wil\t\tl 6. won't\nACTIVITY 4\nAim: To help Ss revise the use of might for future possibility.\n-  Have Ss read the instruction to understand what they have to do.\n-  Ask them to read and complete the sentences individually. Go around and offer help if necessary.\n- Have them swap their answers in pairs or groups before checking as a class. Correct mistakes if  necessary.\n- Call on some Ss to read the complete sentences in front of the class. T and other Ss listen and make comments.\nKey: 1. might \t\t2. might \t\t3. might not \t\t4. might not \t\t5. might, might"
            },
            {
              "id": "680c5d6f-6866-433b-98e7-02a249fe7cf4",
              "name": "PROJECT",
              "content": "Aim: To help Ss apply what they have learnt in the unit in the project.\n- Have Ss read the project's instructions. Draw their attention to the following steps:\n+ Think about one appliance they want to have in the future.\n+ Make a poster about it.\n+ Write details about the appliance on the poster (what they want to have, what it will help them to do).\n+ Share the poster with their class.\n-  Have them think about an appliance in their future house first.\n-  Give them time to make their own posters by drawing their own appliances.\n-  Ask them to look at the details in the bubble as an example. Then have them write what the appliances  will help them to do in their future houses.\n-  Get them to share their posters in pairs or groups.\n- Select some Ss to show their posters in front of the class and tell what the appliances will do in their  future houses. The class gives comments.\n-  If there is not enough time, T may ask Ss to do the project as homework and check it during the next period.\nNOW I CAN...\nFinally, ask Ss to complete the self-assessment table. Identify any difficulties and provide further practice."
            }
          ]
        },
        {
          "id": "db8f6efc-c570-48f5-850d-21f34351bec1",
          "name": "Unit 11 Our Greener World",
          "lessons": [
            {
              "id": "41b3497f-8b98-40a1-a886-2c7979ddd5e5",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n-  use the words for things that can be reduced, reused and recycled;\n- say sentences with correct rhythm;\n- use the articles correctly;\n-  use the first conditional to talk about possibilities;\n-  give warnings;\n- read for general and specific information about ways to go green at school;\n-  talk about tips for going green;\n- listen for details about ideas for a green club;\n-  write a paragraph about ideas for a green club.\nWARM-UP & INTRODUCTION\nAims:\n- To create an active atmosphere in the class before the lesson;\n-  To lead into the new unit.\nReview the previous unit before Ss open their books. Write Our houses in the future on\nthe board and have Ss say all of the words that are related to this topic.\nWrite Our Greener World on the board. Ask Ss what green means to them. Write their  answers on the board. Explain that green has a lot of meanings. In this unit it means  relating to the protection of the environment. Write Let's go green! on the board and  elicit the meaning of go green from Ss. Tell Ss that go green means: to do more to protect nature and the environment. Have Ss open their books and start the lesson.\nenc»\nLET’S GO GREEN!\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n-  To introduce the topic of the unit.\n- Ask Ss to look at the pictures on pages 48 - 49 and answer the questions below:  1.Who are they? (Nick and Mi.)\n2. Where are they? (At the supermarket.)\n3. What might they be talking about? (Ways to go green.)\n- Quickly write Ss’ answers to Question 3 on the board. Play the recording. Ss listen and read. Ask Ss if  their guesses on the board are correct.\n- Play the recording twice for Ss to listen and read along. Have Ss underline the words that are related to  the topic of the unit while listening and reading.\n-  Invite some pairs of Ss to read the conversation aloud.\n-  Ask Ss what exactly Mi and Nick talked about. Now confirm the correct answer. (They talked about  ways to go green.)\n-  Have Ss say the words in the text that they think are related to the topic Our greener world. Quickly  write the words on one part of the board. Comment on Ss’ answers.\nACTIVITY 2\nAim: To help Ss understand the text in depth.\n- Ask Ss to work independently to fill each blank with the word(s) from the conversation. Ask them how  to do this exercise. T may once again instruct them how to do the exercise: (1) read the sentence and  identify the kind of information to fill the blank; (2) read the conversation and locate the place to find  the word(s) to fill the blank. Model with the first sentence.\n--  Allow Ss to share answers before discussing them as a class. Write the correct answers on the board.\nKey:\n1.a picnic \t\t2. plastic one \t\t\t3. the check-out\n4.a reusable \t\t5. she’s cycling\nACTIVITY 3\nAims:\n- Tohelp Ss understand the text in depth;\n-  Todraw Ss’ attention to the first conditional.\n-  First, ask Ss to read columns Aand Bto make sure they understand. Ask Ss to give their answers without  reading the conversation again. Then ask them to read the conversation and check their answers.  Confirm the correct answers.\n-  Tell Ss that sentences 2 and 3 are first conditional sentences and they will learn about this grammar  point in\nKey: 1.b\t2.c\t3.a\nACTIVITY 4\nAim: To develop Ss’ knowledge of the vocabulary for how to help the environment.\n-  Have Ss look at the pictures and discuss what they can see in each picture in pairs. Invite some pairs to  share their answers with the whole class.\n~ Ask Ss to match the pictures with ways to help the environment. Have some Ss share their answers.  Confirm the correct answers.\n- Ask Ss to add any other ways to save the environment they know.\nKey: 1.c \t2.a \t3.b \t4.e \t5.d\nACTIVITY 5\nAim: To provide Ss with an opportunity to communicate with each other, using the vocabulary  they have learnt.\n- Ask Ss to work in groups. Give each group a handout with the following table:\n- Model the way to ask questions and answers with a student (e.g. Nam, do you use reusable bags?, etc.).  Ask each group to choose one student to ask the questions and another student to record the answers  and report the results. Give Ss 5 - 7 minutes to ask and answer in groups. Move around to observe and  offer help.\n-  Invite Ss to share their findings to the class.\nWRAP-UP\n-  Ask one or two Ss to tell the class what they have learnt.\n- Ask Ss to say some words they remember from the lesson."
            },
            {
              "id": "5a200f9b-89b2-4277-ab39-a0e6d5d06256",
              "name": "A CLOSER LOOK 1",
              "content": "Vocabulary\nACTIVITY 1\nAim: To teach the terms reduce, reuse, and recycle.\n-  Have Ss read the information in the table and draw a line from a symbol in column A to the matching  word in column B and its meaning in column C. Ss work in pairs to compare their answers before giving T the answers. Check and write the correct answers on the board.\n-  For stronger classes, elicit the difference between recycle and reuse from Ss. Explain the difference  between these two terms again if necessary:\n+ Recycle means reprocessing an old item such as a newspaper, a glass or a can and turning it into a  new product. For example, used paper is brought to a factory where it is reprocessed, cleaned and  purified. This paper is then used to make new things such as books or newspapers.\n+ Reuse means avoiding the reprocessing procedure. It is when people use something over and over  again until it cannot be used any more. For example, a used plastic bottle can be used again as a  flower vase, or a butter container can be used to grow a small plant.\nACTIVITY 2\nAim: To revise / teach the words for things that can be reduced, reused and recycled.\n- Have Ss work in pairs to do this activity. Call on Ss from different pairs to go to the board and write the  words.\n-  This activity can also be organised as a competition. Whichever pair finishes the activity first wins and can go to the board to write their answers. Confirm the correct answers.\nKey:\n1. rubbish \t\t2. plastic bag\t\t 3. glass\t 4. plastic bottle\n5.noise\t\t\t 6. paper\t\t 7. water \t8. clothes\nACTIVITY 3\nAim: To help Ss categorise things that can be reduced, reused and recycled.\n- Have Ss work in pairs to put the words from 2 in appropriate groups. Draw the table on the  board and call three Ss to go to the board and write their answers. Discuss the answers with the class.\nSuggested answers:\n-  Elicit some more words for each group from Ss. Here are some suggested words:\n● Reduce: electricity, gas\n● Reuse: envelope, carton box, textbook\n● Recycle: newspaper, textbook, plastic container\nPronunciation\nRhythm in sentences\nACTIVITY 4\nAim: To get Ss familiar with rhythm in sentences.\n-  Tell Ss that in English, the stressed and unstressed syllables combine to make rhythm in a sentence.  Ss have learnt about stress in two-syllable words, so T can remind them of the stress rule in two-syllable  words (put stress on the first syllable in nouns and adjectives).\n- In the sentences the bold parts are the stressed syllables. The aim of this activity is only to raise  Ss‘ awareness of rhythm. It is not necessary to teach them in detail.\n-  Play the recording for Ss to listen to the sentences. Have them pay attention to the bold parts. Play the  recording of each sentence again for Ss to repeat in chorus. Have Ss work in pairs to practise reading  the sentences. Call on some Ss to read the sentences aloud. Comment on Ss’ pronunciation.\nAudio script:\n1. If you cycle, it'll help the Earth.\n2.Water is good for your body.\n3. The students are planting trees in the garden.\n4.Is it better to use paper bags?\n5. We are happy to walk to school.\nACTIVITY 5\nAim: To give Ss further practice with rhythm in sentences.\n-  Play the recording for Ss to listen to the conversation. Have them pay attention to the bold parts.\n- Play the recording of each sentence again for Ss to repeat in chorus. Have Ss work in pairs to  practise reading the conversation. Call on some Ss to read the conversation aloud. Comment on  Ss’ pronunciation.\nAudio script:\nVy: What are you doing?\nMi: I'm writing an article about going green.\nVy: Great! I'm writing a poem about the 3Rs.\nMi: Let me read it.\nVy: I'm still writing. Wait for a minute.\nWRAP-UP\nHave Ss summarise what they have learnt in this period."
            },
            {
              "id": "0d37f2cc-b8b1-4378-b802-d72ccc22245a",
              "name": "A CLOSER LOOK 2",
              "content": "Grammar\nArticles\n- Write two sentences with articles on the board. This is a book. / The book on the table is my favourite.\n-  Underline a and the. Explain to Ss the difference between these two articles, telling them that a is an  indefinite article and the is a definite article.\n- Use the information in this table to explain to Ss:\nThere are two kinds of articles in English.\n1. Indefinite article: a / an\na + consonant sound an + vowel sound (a, é, i, 0, u)\nE.g.a bag E.g. an apple\n2. Definite article: the\nthe /6a/ + consonant sound the /di/ + vowel sound (a, e, i, 0, u)\nE.g. the bag E.g. the apple\n- Have Ss do Activity 1 before drawing their attention to the Remember! box in the book.\nACTIVITY 1\nAim: To give Ss practice with a and an.\n- Have Ss do the exercise individually and then compare their answers. Invite some Ss to read their  answers aloud. Check their answers in front of the class.\nKey:\n1.an \t\t2.a \t\t3.a \t\t4.an\n5.a \t\t6.an \t\t7.an \t\t8.a\n-  Now draw Ss’ attention to the Remember! box. Have Ss read the information. Explain the information  again if necessary.\nACTIVITY 2\nAim: To give Ss further practice with a/an and the.\nHave Ss read the sentences and fill each blank with a suitable article. Check and confirm the correct  answers.\nKey: 1.a \t2. The; the \t\t3.A;an \t\t4.an \t\t5. the; the\nFirst conditional\n-  Tell Ss that they are going to learn the first conditional. Ask Ss to have a closer look at the Grammar  box. Explain to them that there are two clauses in a conditional sentence and when the main clause  comes before the if clause, there isn’t a comma between the two clauses.\n-  Give some more examples with the first conditional.\nACTIVITY 3\nAim: To give Ss practice with the first conditional.\nHave Ss do this exercise quickly then give the answers to T. Write their answers on the board and confirm the correct answers.\nKey:\n1. is; will go \t\t2. recycle; will help \t\t\t3. will save; don’t waste\n4. will have; use \t5. isn't /is not; will be\nACTIVITY 4\nAim: To give Ss further practice with the first conditional.\nIf necessary, T can combine the first pair of sentences as an example. Have Ss do this exercise in pairs.  Ask some Ss to write their sentences on the board. Ask for feedback from other Ss. Confirm the correct  answers.\nKey:\n1. If the air isn’t fresh, people will cough.\n2. If the water is dirty, a lot of fish will die.\n3. If we cut down trees in the forest, there will be more floods.\n4. If there is too much noise, people will not / won't sleep.\n5. If there is no water, plants will die.\nACTIVITY 5\nAim: To give Ss fun practice with the first conditional.\nDivide the class into groups (A and B) and give each student a strip of paper. Tell Ss from group A to  write an if-clause. Ss from group B write a main clause. After 5 minutes have Ss try to make a sentence by  matching the clause on their paper with a clause from the other group. Ask Ss to read their sentences  aloud.\nWRAP-UP\n- Summarise the main points of the lesson.\n- Ask Ss to make sentences, using the first conditional."
            },
            {
              "id": "d6de826c-992f-4aa7-a15b-a7513d0ffb10",
              "name": "COMMUNICATION",
              "content": "Everyday English\nGiving warnings\nTell Ss that they are going to learn how to give warnings.\nACTIVITIES 1 + 2\nAims:\n- To introduce two ways to give warnings in English;\n- To help Ss practise giving warnings.\n1 Play the recording for Ss to listen and read the dialogue between Mi and Mike at the same time. Ask  Ss to pay attention to the highlighted sentences. Elicit the structures to give warnings (Imperative  sentences / first conditional). Have Ss practise the dialogue in pairs. Call on some pairs to practise the  dialogue in front of the class.\nAudio script:\nMi: You are giving the goldfish too much food. Don't do that.\nMike: Why?\nMi: If you give them too much food, they will die.\nMike: | see. Thank you.\n2 Ask Ss to work in pairs to make a similar dialogue, using the language for giving warnings. Move  around to observe and provide help. Call on some pairs to practise in front of the class.\nA survey on ways to go green\nACTIVITY 3\nAim: To give Ss a chance to know if they are going green.\n-  Review the first conditional sentence before Ss do 3. Revise or teach some vocabulary:  do a survey: ask people questions in order to find out about their opinions or behaviour  wrap: cover or surround something with paper, cloth or other material be in need: not have enough food, money, clothes, etc.\nbreeze: a light and pleasant wind\n-  Have Ss read the questions quickly and make sure that they know what to do. Ss answer the questions  individually, then turn to page 57 to check their answers and count the points. Ask some Ss to speak  out their points.\nACTIVITY 4\nAim: To give Ss an opportunity to ask and answer about going green.\nHave Ss work in pairs. One student is the interviewer, and the other is the interviewee. Ask them to do  the interview in about 5 - 7 minutes and to note down their friend's answers. The interviewer then shares  their answers with their friend and find out how many different answers they have. Call on some Ss to  report the results of their interview to the class.\nWRAP-UP\nHave Ss tell you what they have learnt (give warnings)."
            },
            {
              "id": "d1d78479-298f-46df-88bd-dcd369a2360d",
              "name": "SKILLS 1",
              "content": "Reading\nTell Ss that they are going to read an interview about ways to go green at school.\nACTIVITY 1\nAim: To help Ss develop the skill of locating specific words in the text.\nAsk Ss to read the interview quickly and locate the words / phrases from the box in the text. Have them  highlight the words / phrases they have found. Invite some Ss to share where they have found the words /  phrases. If T uses slides, show the text with the highlighted words / phrases to prepare for the next activity.\nACTIVITY 2\nAim: To help Ss develop the skill of guessing the meaning of words / phrases in context.\nTell Ss how to do the activity. Remind them to look again at the words / phrases that have been highlighted  in 1 and read the surrounding sentences carefully to get the meaning of each word / phrase, and then  match the word / phrase with the given meaning. Have Ss do this exercise individually and then compare  their answers with a classmate. Ask for Ss’ answers. Confirm the correct answers. Ask Ss to give some  examples with the words / phrases.\nKey: 1.e \t2.d \t3.a \t4.b \t5.c\nACTIVITY 3\nAim: To help Ss develop the skill of reading for general and specific information.\n- Have $s read the interview again to answer the questions. Ss can underline parts of the text that helped  them with the answers. Set a strict time limit to ensure Ss read quickly for information.\n-  Have Ss compare their answers before giving the answers to T. Ask them to cite evidence when giving  the answers.\nKey:\n1. Ways to become greener at school\n2. Recycing bins\n3. Exchange old uniforms with friends or give them to charity\n4. Borrow books from the library\n5. Reusable water bottles\nSpeaking\nACTIVITY 4\nAim: To give Ss a chance to discuss their opinions about green tips.\n- Have Ss work in groups to discuss and order the tips from the easiest to the most difficult. They also  think of ways to explain the reasons for their order. Ask a member from several of the groups to write  their order on the board. Hold a class discussion about the orders. Accept different answers as long as  the groups can justify it.\n- Elicit some other tips from Ss and quickly write them on the board. Ss comment on the tips.\nACTIVITY 5\nAim: To give Ss a chance to share ways to reuse things.\nHave Ss work in groups and find creative ways to reuse the items indicated in the book. This activity can  be organised as a competitive game. Give the groups 8 minutes to list out the ways to reuse the items  creatively. When the time is up, each group will present their answers. The group having the most creative  ways wins.\nWRAP-UP\nHave Ss tell what they have learnt (ways to go green, tips for going green)."
            },
            {
              "id": "64384d1e-5880-473c-a26c-5d0723d4900d",
              "name": "SKILLS 2",
              "content": "Listening\nTell Ss that the 3Rs Club is looking for a new president. Quickly elicit the necessary qualities of the club  president from Ss and write them on the board. Have Ss read the advertisement for this position. Ask  them what they will do if they become the club president.\nACTIVITY 1\nAim: To help Ss develop listening for specific information.\n-  Have Ss read the instructions of the first activity. Have Ss guess the word / number to fill each blank  and write their guesses on the board. Play the recording and ask Ss to listen to fill the blanks and check  their guesses. Ss work in pairs to compare their answers before T plays the recording the second time  for pairs to check their answers.\n-  Ask for Ss’answers. Confirm the correct answers and write them on the board next to their guesses.\nKey:\n1.6A\t\t 2. recycling \t\t3. book\n4.6E \t\t5. bus \t\t\t6. uniform\nACTIVITY 2\nAim: To help Ss develop the skill of listening for specific information.\nHave Ss read the statements in 2 and tick ($\\checkmark$) T or F at the end of each statement without listening to the  recording. If they have any difficulty doing this, play the recording again. Have Ss compare their answers in pairs before submitting answers. Write the correct answers on the board.\nKey: 1.F \t2.7 \t\t3.F \t\t4.T\nAudio script:\nMi:I'm Mi from class 6A. If! become the president of the Club, I'll first talk to my friends about putting  a recycling bin in every classroom. We can reuse the things we have in these bins. Secondly, I'll  organise some book fairs. Students can exchange their used books at these fairs.  Nam: I'm Nam from class 6E. If | become the president of the Club, I'll encourage students  to go to school by bus. It'll be fun and help the environment. Next, I'll organise some uniform fairs.\nThis is where students can exchange used uniforms with other students.\nWriting\n-  In this writing part, Ss are asked to write about a classmate's ideas if he / she becomes the president of  the club.\n- Ask Ss to read the Study skill - Writing! box. T may explain the use of connectors to show sequence  by referring to the listening part. Also tell them that when they write they should give explanations  and examples to support their ideas. Have them look at the example in the Study skill - Writing! box.\nACTIVITY 3\nAim: To help Ss generate ideas for their writing.\nHave Ss work in pairs and interview each other to find out the two things they will do if they become the  club president. Ask Ss to take notes of each other’s ideas. Ask Ss to expand their ideas by explaining the  idea and/ or giving examples. If time allows, have some Ss present their friend's ideas or write the ideas  on the board.\nACTIVITY 4\nAim: To help Ss practise writing a paragraph about their classmates’ ideas for the 3Rs Club.\n-  Have Ss write individually based on the ideas they have had in 3. If time allows, ask one student to  write it on the board. Other Ss and T comment on the paragraph on the board. Then T collects some  writings to correct at home.\n- Alternatively, ask Ss to work in groups and choose the two best ideas to write about. Give each group  a large piece of paper to write on. Ask one or two groups to stick their product on the board. Other Ss  and T give comments. Ss copy their group's writing into their notebooks and revise as homework."
            },
            {
              "id": "70029556-0e5e-4171-ad62-2269011b06ed",
              "name": "LOOKING BACK",
              "content": "Encourage Ss not to refer back to the unit. Ask them to keep a record of their answers to each exercise so  that they can use that information to complete the self-assessment table at the end of the unit.\nVocabulary\nACTIVITY 1\nAim: To help Ss revise the words Ss have learnt in the unit.\nHave Ss do this activity individually then compare their answers with a partner. Ask three Ss to go to the  board, each writing a word web on the board. Elicit other words from Ss to add to the webs.\nGrammar\nACTIVITY 2\nAim: To help Ss practise using the articles a/ an and the.\nHave Ss do this exercise individually and then give the answers to T. Confirm the correct answers.  If necessary, ask Ss to tell about the use of the articles before doing the exercise.\nKey: 1.a \t\t2.an\t\t 3. The\t\t 4.The \t\t5.a;an\nACTIVITY 3\nAim: To provide Ss with practice on the first conditional.\nHave Ss revise the form and use of the first conditional. Ask them to do this exercise individually then  compare their answers with a partner. Call on some Ss to write their answers on the board. Confirm the correct answers.\nKey:\n1. build; will be \t\t2. will save; reuse \t\t3. grow; will be\n4. don't have; will be\t\t 5. are; will be\nACTIVITY 4\nAim: To provide Ss with further practice on the first conditional.\nHave Ss do this exercise individually then compare their answers with a partner. Invite some Ss to write  their answers on the board. Give feedback and confirm the correct sentences.\nKey:\n1. If we walk or cycle, we will be healthy.\n2. If we use the car all the time, we will make the air dirty.\n3. If you reuse paper, you will save trees.\n4. If you make noise, your sister will not / won't sleep.\n5. If I see a used bottle on the road, I will put it in the bin."
            },
            {
              "id": "6f7c69bc-a01c-4d12-8fed-8c4500ef6e87",
              "name": "PROJECT",
              "content": "-  Ask Ss to look at the pictures and discuss the two questions in pairs. Elicit the answers from Ss.  Now ask Ss to work in pairs or groups to do the project. Ss follow the instructions in the book. Remember  to have a‘Show and tell’session and vote for the best product(s).\n- If time is limited, T can assign the project in earlier lessons such as in GETTING STARTED lesson.  Make sure you guide them carefully and check their progress after each lesson. In the last lesson  (LOOKING BACK), ask Ss to present their products to the class.\nNOW I CAN...\nAsk Ss to complete the self-assessment table. Identify any difficulties and provide further practice."
            }
          ]
        },
        {
          "id": "17b10bb2-38d6-4475-be3d-7fd2d9b3d415",
          "name": "Unit 12 Robots",
          "lessons": []
        },
        {
          "id": "6d5af58a-4cef-4470-88e6-53da3e9b5827",
          "name": "Unit 12",
          "lessons": [
            {
              "id": "c4d65a8c-12c8-4001-9bd3-b83facaea38e",
              "name": "GETTING STARTED",
              "content": "Objectives:\nBy the end of this unit, students will be able to:\n- use the words for daily activities;\n- say statements with correct tones;\n- compare people and things using superlative adjectives;\n- express agreement and disagreement about something;\n- read for specific information about an international robot show;\n- talk about what robots can do;\n- listen for specific information about what robots can do;\n- write a paragraph about a robot one would like to have.\nWARM-UP & INTRODUCTION\nAims:\n- To create an active atmosphere in the class before the lesson;\n- To lead into the new unit.\nReview the previous unit before Ss open their books. T may organise a short vocabulary game, e.g. Alphabet Race or Slap the Board, etc. to revise the words Ss have learnt in Unit 11.\nLead to the new unit. Write the unit title Robots on the board. Ask Ss to guess what they are going to learn about in this unit. After Ss respond, ask them to open their books to page 58. Draw their attention to the box and introduce what they are going\nAT AN INTERNATIONAL ROBOT SHOW\nACTIVITY 1\nAims:\n- To set the context for the introductory text;\n-  To introduce the topic of the unit.\n-  Set the context for the introductory text by asking Ss questions such as Where are Nick, Phong and  Dr Adams?, What are they talking about? T can ask Ss to guess Dr Adams’ job. T can also ask Ss to share  any recent experiences of visiting a show: Have you ever been to a show?, Where and when?, What did  you see there? Encourage Ss to give T their answers, but do not confirm whether their answers are right  or wrong. Ask them to talk a bit about types of robots they know.\n-  Play the recording twice for Ss to listen and read along. Have Ss underline the words that are related to  the topic of the unit while they are listening and reading.\n-  Invite some pairs of Ss to read the dialogue aloud.\n- Ask Ss what exactly Nick, Phong, and Dr Adams are talking about. Now confirm the correct answer  (They are talking about what the robots in the show can do).\n-  Have Ss say the words in the text that they think are related to the topic Robots. Quickly write the words  on one part of the board. Comment on Ss’ answers.\nACTIVITY 2\nAim: To help Ss understand the text.\n-  Have Ss look at the statements in this activity. Tell them how to do it. Give them some strategies to do  the exercise (e.g. reading the statements, underlining the key words, reading the text paying attention  to the key words, deciding if each sentence is true or false).\n- Set a time limit for Ss to do the activity independently. When the time is up, have Ss share their answers  in pairs. Invite some pairs to give their answers and confirm the correct ones. For stronger classes, ask  Ss to correct the false sentences.\nKey: 1.T \t2.F \t3.T \t4.F\t 5.T\nACTIVITY 3\nAim: To help Ss further understand the text.\n- Ask Ss to work independently to fill each blank with the adjective in the box from the conversation.  T may instruct them how to do the exercise: (1) read the sentence with the blank and try to work out the  meaning from the whole sentence; (2) find the adjective in the box that can fit the blank meaningfully.  Model with the first sentence.\n-  Allow Ss to share answers before discussing as a class. Write the correct answers on the board.\nKey: 1. useful \t\t2. fast \t\t3. strong \t4.smart \t5. heavy\nACTIVITY 4\nAim: To develop Ss’ knowledge of vocabulary about daily activities.\n-  Have Ss quickly match each activity with the picture individually. Then ask Ss to check their answers  with their partners.\n-  Asksome Ss to read out their answers or write them on the board. Check the answers as a class.\n- With weaker classes, ask for the translations of the activities. With stronger classes, T may ask some  additional questions, e.g. Can you iron clothes /make meals ...? Who often makes meals in your family? etc.\nKey: 1.b \t2.c \t3.e \t\t4.d \t\t5.f\t\t 6.a\nACTIVITY 5\nAim: To help Ss practise saying phrases of daily activities introduced in 4.\n- Demonstrate the game to the class first. Ask a stronger student to help you.\n- Ask Ss to play in groups. In a weaker class, T may work together with Ss first: miming one or two activities  in 4 and eliciting the answers. When they know exactly what to do, ask them to work in groups.\n- Askone or two Ss to tell the class what they have learnt. Ask Ss to say some words they remember from  the lesson.\n-  If there is a visualiser in the classroom, show the dialogue and highlight the key words related to the  topic. It would be helpful if T also highlights in the dialogue the superlative adjectives and tells Ss that  they will learn these language points in the following lessons."
            },
            {
              "id": "98e78182-d5d9-4316-8e6b-2547ff23acc8",
              "name": "A CLOSER LOOK 1",
              "content": "Vocabulary\nACTIVITY 1\nAim: To revise / teach the names of other daily activities.\n-  Have Ss quickly match the verbs in column A to the words / phrases in column B individually. Explain  the words / phrases if necessary.\n-  Play the recording for Ss to check their answers. Pause the recording after each phrase and ask them to  repeat chorally and individually. Correct their pronunciation. With a weaker class, ask for translations  to check understanding. With a stronger class, ask some additional questions, e.g. Can you do the  washing?, Can your dog understand your feelings? etc.\nKey:1.c.\t 2.a \t3.b \t4.e \t\t5.d\nAudio script:\n1. understand our feelings\n2. pick fruit\n3.do the washing\n4. water plants\n5. work as a guard\nACTIVITY 2\nAim: To help Ss practise describing people’s abilities, using the modal can / can’t and the phrases  they have learnt in 1.\n-  Help Ss recall the use of can to talk about ability in the present and have some Ss give examples.\n-  Ask a stronger student to tell what activities in 1 he / she can or can’t do. Ask Ss to do the same in pairs.  T may go around to help weaker Ss.\nACTIVITY 3\nAim: To give Ss further practice on asking and answering about abilities, using the modal can /  can’t and daily activities.\n--  First, model this activity with a stronger student. Remind Ss that they only use the information from the  table to ask and answer about what the robot V10 can or can’t do.\n- Then ask Ss to work in pairs. Call on some pairs to practise in front of the class.\nPronunciation\nFalling tone in statements\nACTIVITY 4\nAim: To help Ss identify how to say statements with the correct tone.\n-  Model the statement “/ often water plants after school.” first, and then ask Ss to identify the tone. Briefly  explain to them that we use falling tone at the end of a statement. Ask Ss to practise falling tone with  the example in the Remember! box.\n-  Play the recording and ask Ss to listen and repeat the statements. Play the recording as many times as  necessary.\n- Asksome Ss to read out the statements and invite comments from other Ss.\nAudio script:\n1.1 often water plants after school.\n2. Shifa can do many things like humans.\n3. My dad makes delicious meals at weekends.\n4. WB2 is the strongest of all the robots.\n5.H8 is a home robot.\nACTIVITY 5\nAim: To help Ss practise saying statements with the correct tone in context.\n-  Have Ss say the statements in the paragraph in pairs: one reads out the statements and the other  comments. Then play the recording for Ss to listen and compare with their partner's pronunciation.\n-  Play the recording again for Ss to repeat each statement of the paragraph. Call on some Ss to read out the\nparagraph. Comment on their pronunciation of the falling tone at the end of each statement.\nAudio script:\nMy robot is Jimba. It’s a home robot. It’s very helpful. It can do the housework. It can also water  plants and pick fruit. It can work as a guard. | love my robot very much.\nWRAP-UP\nAsk Ss to summarise what they have learnt in the lesson."
            },
            {
              "id": "b95eda29-6b51-49c9-adea-4cad737275b9",
              "name": "A CLOSER LOOK 2",
              "content": "Grammar\nSuperlative adjectives: short adjectives\n- Choose three or more Ss of very different heights and ask them to come to the front of the class and  line up. T asks the class: Who is the tallest? Indicate tall and tallest with your hands and arms. Ask Ss to  say what tallest is in Vietnamese. T introduces the subject of the lesson: superlative adjectives, and asks  for the equivalent in Vietnamese (Cap so sdnh cao nhdt cua tinh te).\n- Have Ss look at the Remember! box about the use of superlative adjectives. Briefly explain to them  that superlative adjectives are used to compare more than two people or things, expressing the  highest degree. Explain that the superlative of short adjectives is constructed in several different ways in English, and that some of those ways are presented in the Grammar box below.\nACTIVITY 1\nAim: To help Ss practise forming the correct form of superlative adjectives.\n- Ask Ss to read the instruction. Tell Ss what they should do. (With a weaker class, do the first word as an  example).\n- Ask Ss to do the exercise individually and then compare their answers with a classmate. Check the  answers as a class. Confirm the correct answers.\nKey:\nACTIVITY 2\nAim: To help Ss practise forming the correct form of superlative adjectives in the sentences.\n-  Ask Ss to read the instruction. Tell Ss what they should do. The first sentence is done as an example.\n- Ask Ss to do the exercise individually and then compare their answers with a classmate. Check the answers as a class. Confirm the correct answers.\nKey: 2. smartest \t3. tallest\t 4. smallest \t\t5. cheapest\nACTIVITY 3\nAims:\n- To help Ss practise forming the correct form of superlative adjectives;\n- To help Ss revise the form and use of comparative adjectives;\n-  To help Ss distinguish between comparative adjectives and superlative adjectives.\nHave Ss do this exercise individually. Call on two Ss to write their answers on the board. Draw all Ss’ attention to the board and check the answers together. Confirm the correct answers.  (\nKey: 1. tidier \t\t2. hottest \t\t3. faster \t\t4. tallest \t\t5. smarter\nACTIVITY 4\nAim: To give Ss further practice on using superlative adjectives.\n-  Ask Ss to look at 4 and explain what they have to do. First, model this activity with a stronger student.  Remind Ss that they only use the information from the table to describe the three robots using  superlative adjectives. T may explain the meaning of the words age, weight, height, price and ask Ss to.  elicit the adjectives they can use to describe each row.\n- Have Ss work in pairs to say sentences comparing the three robots. Move around to offer help  if needed.\nACTIVITY 5\nAim: To give Ss further practice on using superlative adjectives.\n-  First, model the game Find someone who... with a stronger student.\n-  Have Ss work in pairs to ask and answer questions to find out the student who is the shortest / tallest /  smartest, etc. in their class. Move around to offer help if needed. If there is enough time, ask Ss to compare  their findings with other pairs’.\nWRAP-UP\n-  Summarise what they have learnt in the lesson.\n- Ask Ss to give some sentences with superlative form of short adjectives."
            },
            {
              "id": "87f4aff7-ef3e-413d-bb25-56f1058e2461",
              "name": "COMMUNICATION",
              "content": "Everyday English\nExpressing agreement and disagreement\nTell Ss that they are going to learn how to express agreement and disagreement. Ask Ss if they know any  ways to express agreement and disagreement.\nACTIVITIES 1 + 2\nAims:\n-  To introduce two ways to express agreement and disagreement in English;\n-  To help Ss practise expressing agreement and disagreement.\n1.\n-  Play the recording for Ss to listen and read the two short dialogues between A and B at the same time.  Ask Ss to pay attention to the highlighted sentences.\n-  Elicit the structures to express agreement and disagreement from Ss (/ agree / disagree with ...). Have Ss  practise the dialogues in pairs. Call on some pairs to practise the dialogues in front of the class.\nAudio script:\nA: | think robots can help us a lot in our daily life.\nB:| agree with you.\nA: Peter says robots can do everything like humans.\nB:| don’t agree with him.\n2.\n-  Have Ss read the instruction and given statements.\n- Ask Ss to work in pairs to make similar dialogues, using the structures for expressing agreement and  disagreement. Move around to observe and provide help.\n-  Call on some pairs to practise in front of the class. Comment on their performance.\nMy robot's abil\nACTIVITY 3\nAim: To help Ss practise using some grammar points and vocabulary related to the topic.\n- First, play the recording and ask Ss to listen only. Then play the recording again and allow Ss to fill the  blanks as they listen.\n- Ask Ss to share their answers in pairs, before playing the recording a final time to allow the pairs to  check their answers. Then ask Ss to read the radio programme again, paying attention to the use of the  words of daily activities.\nKey: 1. understand \t\t2. smartest \t\t3. put \t\t4. water \t\t5. guard\nAudio script:\nSpeaker: Today we ask our friends: Tom from Australia, Linh from Viet Nam and Nobita from Japan  to tell us about their robots. Tom, would you like to start?\nTom: Well, my robot can understand what | say. It can also understand my feelings. It’s the smartest  robot.\nSpeaker: Linh?\nLinh: My robot is my best friend. It does a lot for me: clean the floor, put my toys away, and...  Speaker: And Nobita?\nNobita: My robot is very useful. It helps me a lot. It can water my plants and even work as a guard.\nACTIVITY 4\nAims:\n-  To help Ss practise asking and answering about robots’ abilities;\n- To help Ss gain information for their report on robots’ abilities.\n- Have Ss move around and ask three classmates what abilities they want their robots to have. Remind  them to write the names of the people they interview and note the answers in the table in 4.\n-  When they have finished the interviews, T may have Ss practise reporting the results of their interviews  in pairs or in groups.\nACTIVITY 5\nAim: To help Ss practise reporting the results of their interviews.\nChoose some Ss to report the results of their interviews in front of the whole class. After each student  has finished his / her report, invite some comments from other Ss. Then make comments and correct any  common errors.\nWRAP-UP\nHave Ss say what they have learnt in the lesson."
            },
            {
              "id": "c5092081-bcfb-4999-b386-7a7d5a9ba236",
              "name": "SKILLS 1",
              "content": "Reading\nACTIVITY 1\nAim: To help Ss understand and activate their knowledge of the topic.\n- Ask Ss to work in pairs discussing questions about their knowledge of robots.\n- Ask some Ss to say their answers in front of the class. T may ask some other questions about the  activities each type of robots can or can't do.\nACTIVITY 2\nAim: To help Ss develop reading for specific information (scanning).\n-  Have Ss read the text in detail to answer the questions. Ask them how to do this kind of exercise. Explain  the strategies if necessary (e.g. reading the questions and the options (A, B, C), underlining the key words  in the questions and options, locating the key words in the text, and then reading that part and answering  the questions).\n- Tell them to underline parts of the passage that help them with the answers. Set a strict time limit to  ensure Ss read the text quickly for information.\n-  Tell them to compare their answers in pairs before giving their answers to T. Ask them to give evidence  when giving the answers. Check as a class.\nKey:1.B \t2.C \t3.C \t4.C\nACTIVITY 3\nAim: To help Ss further develop reading for specific information (scanning).\nAsk Ss to scan the text again and find the detailed information to complete the table. Ask Ss to note  where they have found the information. After they finish, Ss can compare their answers before discussing\nthem as a class.\nKey:\nSpeaking\nACTIVITY 4\nAim: To help Ss prepare ideas for the next activity.\nAsk Ss to work in pairs asking and answering about what robots can do in the places given in the first  column of the table. Move around to observe and provide help. Call on some pairs to practise in front of  the class. Comment on their performance.\nACTIVITY 5\nAim: To provide an opportunity for Ss to practise describing what robots can do.\nT may ask a strong student to model this activity in front of the class. Then have Ss work in groups while  T circulates and monitors. If there is enough time, call some Ss to talk before the whole class, then invite  some positive comments from other Ss.\nWRAP-UP\nHave Ss tell about what types of robots there are and what they can do."
            },
            {
              "id": "4c25653c-7d8b-4a7e-97bd-f321305c518c",
              "name": "SKILLS 2",
              "content": "Listening\nBefore starting this lesson, ask Ss about the content of the previous lesson. T may ask Ss to tell about what  types of robots there are and what they can do.\nACTIVITY 1\nAims:\n- To help Ss understand the gist of the conversation;\n-  To help Ss develop the skill of listening for specific information.\n-  First, ask Ss to underline the key words in each of the five given phrases and guess which phrases will  appear in the conversation.\n- Play the recording and ask Ss to tick the phrases they hear from the conversation. Then ask two or three  Ss to write their answers on the board.\n- Play the recording again for Ss to check the answers. If time is limited, T mayonly play the recording once.  T may pause at the sentences that include the information Ss need for their answers.\nKey:\n- look after sick people\n-  understand what we say\n-  build the very high buildings\n-  teach many subjects\n- move heavy things\nACTIVITY 2\nAim: To help Ss develop the skill of listening for specific information.\n-  Have Ss look at the statements in this activity. Ask them how to do it. Give them some strategies to  do the exercise (e.g. reading the questions, underlining the key words, listening to the text paying  attention to the key words, deciding if each sentence is true or false).\n- Play the recording twice for Ss to do exercise 2. For stronger classes, ask Ss to take notes of the  information to explain why a sentence is false.\n-  Have Ss share their answers in pairs. Invite some pairs to give their answers and confirm the correct  ones. Play the recording again if needed, stopping at the place where Ss find it difficult to hear. For a  better class, ask Ss to correct the false sentences.\n- If time allows, invite one or two students to briefly tell about robots focusing on their abilities.\nKey:\n1.F (Robots can do quite a lot today.)\n2.7\n3.T\n4.T\n5.F (No, not everything. They can’t understand our feelings or play football.)\nAudio script:\nKhang: Dr Adams, please tell me something about robots.\nDrAdams: Sure. Robots can do quite a lot today. Home robots can do housework. Doctor robots  can look after sick people. And...\nKhang: Can robots build houses?\nDrAdams: Yes. Worker robots can even build the very high buildings.\nKhang: Can they teach?\nDrAdams: Yes. Teacher robots can teach many subjects in a classroom or online.  Khang: Can they understand what we say?\nDrAdams: Yes, they do. They can even speak to us.\nKhang: Robots can do everything like humans?\nDrAdams: No, not everything. They can’t understand our feelings or play football.\nWriting\nACTIVITY 3\nAim: To help Ss prepare ideas for writing.\n- Ask Ss to describe a robot they want to design (its name, type of robot, where it can work and what it  can do). Remind them that they do not have to write full sentences and they can use abbreviations.\n-  Then, ask Ss to share their notes with their partners. T may read out the notes from some stronger Ss  to the whole class.\nACTIVITY 4\nAim: To help Ss practise writing a paragraph about a robot they would like to have.\n- Set up the writing activity: T reminds Ss that the first thing is always to consider what they are going  to write. Ss can use the ideas they have prepared in 3.T asks Ss to brainstorm for the ideas and the  language needed to write. T may ask Ss to refer back to the reading for useful language and ideas, and  write some useful expressions and language on the board.\n-  Ask Ss to write the first draft individually. Next ask Ss to work in pairs making peer corrections. Then have  them write their final version. T may display all or some of Ss’ writings on the wall / notice board. T and  other Ss give comments. Ss edit and revise their writings. If time is limited, T may ask Ss to write the final  version at home."
            },
            {
              "id": "8b8f385a-7157-4a2b-a87b-e163d3fd8a8b",
              "name": "LOOKING BACK",
              "content": "Encourage Ss not to refer back to the unit. Ask them to keep a record of their answers to each exercise so  that they can use that information to complete the self-assessment table at the end of the unit.\nVocabulary\nACTIVITIES 1 + 2\nAim: To help Ss revise the vocabulary items they have learnt in the unit.\nHave Ss do these activities individually then compare their answers with their partners. Ask for  Ss’ answers or ask one student to write his / her answer on the board. Confirm the correct answers.\nKey:\n1\n1. iron \t\t2. move \t3. pick \t\t4. washing \t\t5.do\n2\n1. work \t2. make \t3. repair \t4. understand \t\t5. water\nGrammar\nACTIVITIES 3+ 4\nAim: To help Ss revise the form and use of superlative adjectives.\nFor these exercises, have Ss do them individually first. Then they can check their answers with a partner  before discussing the answers as a class. However, tell Ss to keep a record of their original answers so they  can use that information in their Now /can... statements.\nKey:\n3\n1. smartest \t\t2. smallest \t\t3. lightest \t\t4.strongest \t\t5. cheapest\n4\n1. highest \t\t2. largest \t\t3. longest\t\t 4. widest \t\t5. hottest"
            },
            {
              "id": "57c0ba4b-0d0a-4532-954f-7b2bbdfb9e5f",
              "name": "PROJECT",
              "content": "This is to introduce Ss to another way of practising talking about the skills and abilities of the robots they  will design.\nACTIVITY 1\nAsk Ss to work in groups, discussing what the robot they are designing will be like. Ss may use their  imagination to design a robot with the most useful skills and abilities. Write the description of their  robot in the table given. Remind them that they do not have to write full sentences and they can use  abbreviations. Finally, draw their robot in the space provided.\nACTIVITY 2\nAsk each group to show the picture and the description of their robot and present their design to the  whole class. When all groups have presented their designs, T may display all or some of the designs on  the wall or notice board and have the whole class vote on the best robot.\nIf T thinks there may be limited time in this lesson for the project, T can assign the project in earlier lessons  such as in GETTING STARTED lesson. Make sure you guide them carefully and check their progress after  each lesson. In the last lesson (LOOKING BACK), ask Ss to present their robots to the class.\nNOW I CAN...\nAsk Ss to complete the self-assessment table. Identify any difficulties and provide further practice."
            }
          ]
        },
        {
          "id": "51c2e881-7cc4-4303-89c1-4123b85fdd78",
          "name": "REVIEW 4",
          "lessons": [
            {
              "id": "fd601861-975e-4c7c-b9b4-ccc5500e4623",
              "name": "LANGUAGE",
              "content": "Objectives:\nBy the end of this review, students will have revised the language they have\nstudied and the skills they have practised in Units 10 - 12.\nIntroduction\nT may ask Ss what they have learnt so far in terms of language and skills. Summarise their answers in the  end and add some more information if necessary.\nT may use the language review as a self-test. Ss do the exercises in 30 minutes and then T checks their  answers with the whole class. Otherwise, T can cover each activity separately.\nPronunciation\nActivity 1\na\nAim: To help Ss review the stress pattern in two-syllable words learnt in Unit 10.\nAsk Ss to do this exercise individually, and then share their answers with a partner before listening to the  recording to check the answers. Write the correct answers on the board. Play the recording again for Ss  to repeat the words.\nKey:1.C \t2.B \t3.A \t4.C \t5.A\nAudio script:\n1. A. picture \t\tB. village \t\tC. reuse\n2. A.robot\t\t B. exam \t\tC. rubbish\n3. A. control \t\tB. water \t\tC. paper\n4. A.mountain \t\tB. housework \t\tC. reduce\n5. A. repair \t\tB. bottle \t\tC. doctor\nb\nAim: To help Ss review the rhythm in sentences and the tones in statements learnt in Units 11  and 12,\nPlay the recording and ask Ss to repeat in chorus. Tell them to pay attention to the bold syllables and tone  of the sentences. Then call on some Ss to read out the three sentences in front of the whole class. Invite  comments from other Ss.\nAudio script:\n1. My robot helped me repair the broken cooker.\n2. It is better to reuse these shopping bags.\n3. My future house will have solar energy.\nVocabulary\nActivity 2\nAim: To give Ss more practice on how to use some verbs they have learnt in Units 10 - 12.\nAsk Ss to do this exercise individually and then share their answers with a partner. T may ask a student to  write his / her answers on the board. Check the answers with the whole class.\nKey: 1. recycle \t2. receives \t\t3. surfing \t\t4. reduce \t\t5. reuse\nActivity 3\nAim: To help Ss distinguish between some pairs of words, and know how to use them correctly in  context.\nAfter Ss do this exercise individually, quickly check Ss’ answers. T may have to explain to Ss how to use  these pairs of words in sentences if necessary.\n[\nKey: 1. feelings 2. guard 3. make 4.do\nGrammar\nActivity 4\nAim: To help Ss review the form and use of comparative and superlative adjectives.\nElicit the form and use of comparative and superlative adjectives. T may call a student to do the  exercise on the board while other Ss also do it. Check Ss’ answers. Ask them for explanations  if necessary.\nKey: 1. closest \t\t2. taller \t\t3. oldest \t\t4. faster \t\t5. greatest\nActivity 5\nAim: To help Ss review the use of the articles a/ anand the.\nElicit the use of a / an and the. Ask Ss to do this exercise individually and then share their answers with a  partner.T may ask a student to write his / her answers on the board. Check the answers with the whole class.\nKey: 1. a\t\t2. the\t\t3.an\n4. The\t\t\te. The - the\nActivity 6\nAim:To help Ss review the use of might, and the use of the simple present or simple future in context.\nElicit the form and use of might. Ask Ss to tell the differences between the use of will and might.  T may call a student to do the exercise on the board while other Ss also do this. Check Ss’ answers. Ask  them for explanation if necessary.\nKey:\n1. protect \t\t2. might \t\t3. might\n4. have \t\t5. will"
            },
            {
              "id": "dd754e89-9b64-4072-bded-d54c74bd8db3",
              "name": "SKILLS",
              "content": "Reading\nActivity 1\nAim: To give Ss more practice on reading for specific information.\nAsk Ss to do the task individually and check their answers with a partner before giving their answers to  T to confirm the correct answers.\nKey: 1. A \t2.B \t3.A \t4.A\nSpeaking\nActivity 2\nAim: To give Ss more practice on describing their future houses.\nHave Ss work in groups, taking turns describing their future houses and try to persuade their group  members to live in it. Then ask each group to choose a student who has the best future house in the  group to talk about his / her future house in front of the class. Ask some other Ss to give comments and  decide which student has the best future house in the class.\nListening\nActivity 3\nAim: To give Ss more practice on listening for specific information.\nPlay the recording once for Ss to listen and tick the sentences. Play the recording again for Ss to check  their answers. Give the correct answers to Ss. With a weaker class, T may play the recording as many times  as possible until Ss have chosen all their answers.\nKey: 1,2,4,5\nAudio script:\nIn 2004, 120 young people from ten European countries met in Berlin at the first Youth  Eco-Parliament. They gave ideas for improving the environment. Here are some of the things they  advised us to do:\n- Recycle more rubbish (for example, glass, paper and plastic, etc.).\n-  Pick up rubbish in parks or in the streets.\n-  Save energy - turn off lights and TVs when you're not using them.\n-  Use reusable bags instead of plastic bags.\nWriting\nActivity 4\nAim: To help Ss practise writing a paragraph about what Ss think they should do to improve the  environment.\n-  Set up the writing activity. T reminds Ss that the first and most important thing is always to consider  what they are going to write about. In this case, Ss may use the ideas given in 3 or their own ideas.  T may brainstorm with Ss the language necessary for writing and note some useful language on the  board.\n-  Ask Ss to write the draft first. Next ask Ss to work in pairs making peer corrections. Then have them  write their final version in class or at home. If they write in class, they can also do it in pairs or groups.  T may display all or some of the paragraphs on the wall / notice board. Other Ss and T give comments.  Ss edit and revise their writing as homework."
            }
          ]
        }
      ]
    }
  ],
  "total": 1,
  "processed_at": "C:\\SaoKhue\\Qa_service\\gen_qa\\Backend"
}